{
 "cells": [
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "## For specific zones at specific sites, return the run time of the RTU in each of the states (0-5) for a DR event date and a date with a comparable OAT that is not a DR event date.\n",
    "\n",
    "## include table with both DR event date and Comparable date, OAT for both dates, and % of time in each state for each date, possibly include predicted energy use based on the RTU runtime and power of RTU in each state"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 1,
   "metadata": {},
   "outputs": [],
   "source": [
    "import time\n",
    "import datetime\n",
    "import pytz\n",
    "import pandas as pd\n",
    "\n",
    "import os\n",
    "import StringIO\n",
    "import shutil\n",
    "from shutil import copyfile\n",
    "\n",
    "import urllib, json\n",
    "\n",
    "from pandas.tseries.holiday import USFederalHolidayCalendar as calendar\n",
    "from numpy import trapz\n",
    "import numpy as np\n",
    "\n",
    "from matplotlib import style\n",
    "import matplotlib\n",
    "import matplotlib.pyplot as plt\n",
    "import matplotlib.patches as mpatches\n",
    "from matplotlib import colors as mcolors\n",
    "from matplotlib.colors import LinearSegmentedColormap\n",
    "%matplotlib inline\n",
    "\n",
    "import seaborn as sns\n",
    "style.use(\"seaborn-notebook\")\n",
    "#from __future__ import division\n",
    "\n",
    "from prettytable import PrettyTable\n"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 2,
   "metadata": {
    "scrolled": true
   },
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Saw [xbos/hod] HodDB 1 seconds 285.807 ms ago\n"
     ]
    },
    {
     "data": {
      "text/plain": [
       "{'Count': 9,\n",
       " 'Elapsed': 0,\n",
       " 'Errors': None,\n",
       " 'Rows': [{'?zone': 'HVAC_Zone_Theater_2'},\n",
       "  {'?zone': 'HVAC_Zone_Theater_1'},\n",
       "  {'?zone': 'HVAC_Zone_Room_D'},\n",
       "  {'?zone': 'HVAC_Zone_Room_A'},\n",
       "  {'?zone': 'HVAC_Zone_Pegasus_Hall'},\n",
       "  {'?zone': 'HVAC_Zone_Outside'},\n",
       "  {'?zone': 'HVAC_Zone_Main_Hallway'},\n",
       "  {'?zone': 'HVAC_Zone_Lobby'},\n",
       "  {'?zone': 'HVAC_Zone_Back_Hallway'}]}"
      ]
     },
     "metadata": {},
     "output_type": "display_data"
    }
   ],
   "source": [
    "## query the zones at the specified site\n",
    "\n",
    "## calling the hodclient\n",
    "\n",
    "from xbos import get_client\n",
    "from xbos.services.pundat import DataClient, timestamp, make_dataframe, merge_dfs\n",
    "#from xbos.services.hod import HodClientHTTP\n",
    "from xbos.services.hod import HodClient\n",
    "from xbos.devices.thermostat import Thermostat\n",
    "%matplotlib inline\n",
    "\n",
    "## get specified site\n",
    "\n",
    "c = get_client()\n",
    "hod = HodClient(\"xbos/hod\")\n",
    "SITE = 'avenal-movie-theatre'\n",
    "\n",
    "\n",
    "zones = \"\"\"\n",
    "SELECT ?zone FROM %s WHERE {\n",
    "    ?zone rdf:type brick:HVAC_Zone .\n",
    "};\n",
    "\"\"\"\n",
    "\n",
    "dateA = '2018-07-27'\n",
    "\n",
    "res = hod.do_query(zones % SITE)\n",
    "display (res)\n"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 3,
   "metadata": {
    "scrolled": true
   },
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Saw [xbos/hod] HodDB 1 seconds 419.353 ms ago\n"
     ]
    },
    {
     "data": {
      "text/plain": [
       "{'Count': 8,\n",
       " 'Elapsed': 0,\n",
       " 'Errors': None,\n",
       " 'Rows': [{'?state': 'HVAC_Zone_Room_A_tstat_state',\n",
       "   '?state_uuid': 'c9404f38-e36f-303d-a878-90209307bf28'},\n",
       "  {'?state': 'HVAC_Zone_Theater_2_tstat_state',\n",
       "   '?state_uuid': 'c085e817-5116-3c6f-ba9a-6882796ffa5f'},\n",
       "  {'?state': 'HVAC_Zone_Pegasus_Hall_tstat_state',\n",
       "   '?state_uuid': '8c252f6f-accf-3a28-ac71-18cd9e745272'},\n",
       "  {'?state': 'HVAC_Zone_Theater_1_tstat_state',\n",
       "   '?state_uuid': '6c8f111e-cc88-336a-8309-09d0c8b355b0'},\n",
       "  {'?state': 'HVAC_Zone_Room_D_tstat_state',\n",
       "   '?state_uuid': '1bbcfb99-98e3-3a40-a34e-94e41eb35c57'},\n",
       "  {'?state': 'HVAC_Zone_Main_Hallway_tstat_state',\n",
       "   '?state_uuid': 'c876fc25-2499-3357-9b94-387d5227b4a4'},\n",
       "  {'?state': 'HVAC_Zone_Back_Hallway_tstat_state',\n",
       "   '?state_uuid': '8285a29c-dcc5-305a-bb9d-8a2653173e75'},\n",
       "  {'?state': 'HVAC_Zone_Lobby_tstat_state',\n",
       "   '?state_uuid': '812903c9-624e-32e8-a7e1-bbf207c5eba0'}]}"
      ]
     },
     "metadata": {},
     "output_type": "display_data"
    }
   ],
   "source": [
    "## TSTAT State information\n",
    "from xbos import get_client\n",
    "from xbos.services.pundat import DataClient, timestamp, make_dataframe, merge_dfs\n",
    "from xbos.services.hod import HodClientHTTP\n",
    "from xbos.devices.thermostat import Thermostat\n",
    "\n",
    "# get a bosswave client\n",
    "c = get_client()\n",
    "hod = HodClient(\"xbos/hod\")\n",
    "SITE = 'avenal-movie-theatre'\n",
    "\n",
    "# query for TSAT Status\n",
    "states = \"\"\"\n",
    "SELECT ?state ?state_uuid FROM %s WHERE {\n",
    "    ?state rdf:type/rdfs:subClassOf* brick:Thermostat_Status . \n",
    "    ?state bf:uuid ?state_uuid .\n",
    "};\n",
    "\"\"\"\n",
    "\n",
    "state_res = hod.do_query(states % SITE)\n",
    "display (state_res)\n"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 4,
   "metadata": {},
   "outputs": [],
   "source": [
    "## UUIDs for all sensors \n",
    "\n",
    "OAT = 'c3d0f042-2cb7-387c-8867-4190fef4fd2c'  #weather_KTLC1_temperature\n",
    "#Demand = 'ea827a42-e6b9-3e0a-970f-c3a96f0ebea3'  #meter_0xd8d5b9000000b405\n",
    "Pegasus_Hall_State = '8c252f6f-accf-3a28-ac71-18cd9e745272'  #HVAC_Zone_Pegasus_Hall_tstat_state\n",
    "Room_A_State = 'c9404f38-e36f-303d-a878-90209307bf28'  #HVAC_Zone_Room_A_tstat_state\n",
    "Room_D_State = '1bbcfb99-98e3-3a40-a34e-94e41eb35c57'  #HVAC_Zone_Room_D_tstat_state\n",
    "Theater_1_State = '6c8f111e-cc88-336a-8309-09d0c8b355b0'  #HVAC_Zone_Theater_1_tstat_state\n",
    "Theater_2_State = 'c085e817-5116-3c6f-ba9a-6882796ffa5f'  #HVAC_Zone_Theater_2_tstat_state\n"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 5,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Saw [xbos/mdal] MDAL 3 seconds 795.741 ms ago\n",
      "None\n",
      "       8c252f6f-accf-3a28-ac71-18cd9e745272  \\\n",
      "count                                   4.0   \n",
      "mean                                    0.0   \n",
      "std                                     0.0   \n",
      "min                                     0.0   \n",
      "25%                                     0.0   \n",
      "50%                                     0.0   \n",
      "75%                                     0.0   \n",
      "max                                     0.0   \n",
      "\n",
      "       c9404f38-e36f-303d-a878-90209307bf28  \\\n",
      "count                                   4.0   \n",
      "mean                                    2.0   \n",
      "std                                     0.0   \n",
      "min                                     2.0   \n",
      "25%                                     2.0   \n",
      "50%                                     2.0   \n",
      "75%                                     2.0   \n",
      "max                                     2.0   \n",
      "\n",
      "       1bbcfb99-98e3-3a40-a34e-94e41eb35c57  \\\n",
      "count                                   4.0   \n",
      "mean                                    2.0   \n",
      "std                                     0.0   \n",
      "min                                     2.0   \n",
      "25%                                     2.0   \n",
      "50%                                     2.0   \n",
      "75%                                     2.0   \n",
      "max                                     2.0   \n",
      "\n",
      "       6c8f111e-cc88-336a-8309-09d0c8b355b0  \\\n",
      "count                                   4.0   \n",
      "mean                                    0.0   \n",
      "std                                     0.0   \n",
      "min                                     0.0   \n",
      "25%                                     0.0   \n",
      "50%                                     0.0   \n",
      "75%                                     0.0   \n",
      "max                                     0.0   \n",
      "\n",
      "       c085e817-5116-3c6f-ba9a-6882796ffa5f  \n",
      "count                                   4.0  \n",
      "mean                                    0.0  \n",
      "std                                     0.0  \n",
      "min                                     0.0  \n",
      "25%                                     0.0  \n",
      "50%                                     0.0  \n",
      "75%                                     0.0  \n",
      "max                                     0.0  \n"
     ]
    },
    {
     "data": {
      "text/html": [
       "<div>\n",
       "<style scoped>\n",
       "    .dataframe tbody tr th:only-of-type {\n",
       "        vertical-align: middle;\n",
       "    }\n",
       "\n",
       "    .dataframe tbody tr th {\n",
       "        vertical-align: top;\n",
       "    }\n",
       "\n",
       "    .dataframe thead th {\n",
       "        text-align: right;\n",
       "    }\n",
       "</style>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "      <th>8c252f6f-accf-3a28-ac71-18cd9e745272</th>\n",
       "      <th>c9404f38-e36f-303d-a878-90209307bf28</th>\n",
       "      <th>1bbcfb99-98e3-3a40-a34e-94e41eb35c57</th>\n",
       "      <th>6c8f111e-cc88-336a-8309-09d0c8b355b0</th>\n",
       "      <th>c085e817-5116-3c6f-ba9a-6882796ffa5f</th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "    <tr>\n",
       "      <th>2018-07-27 14:00:00-07:00</th>\n",
       "      <td>0.0</td>\n",
       "      <td>2.0</td>\n",
       "      <td>2.0</td>\n",
       "      <td>0.0</td>\n",
       "      <td>0.0</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>2018-07-27 15:00:00-07:00</th>\n",
       "      <td>0.0</td>\n",
       "      <td>2.0</td>\n",
       "      <td>2.0</td>\n",
       "      <td>0.0</td>\n",
       "      <td>0.0</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>2018-07-27 16:00:00-07:00</th>\n",
       "      <td>0.0</td>\n",
       "      <td>2.0</td>\n",
       "      <td>2.0</td>\n",
       "      <td>0.0</td>\n",
       "      <td>0.0</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>2018-07-27 17:00:00-07:00</th>\n",
       "      <td>0.0</td>\n",
       "      <td>2.0</td>\n",
       "      <td>2.0</td>\n",
       "      <td>0.0</td>\n",
       "      <td>0.0</td>\n",
       "    </tr>\n",
       "  </tbody>\n",
       "</table>\n",
       "</div>"
      ],
      "text/plain": [
       "                           8c252f6f-accf-3a28-ac71-18cd9e745272  \\\n",
       "2018-07-27 14:00:00-07:00                                   0.0   \n",
       "2018-07-27 15:00:00-07:00                                   0.0   \n",
       "2018-07-27 16:00:00-07:00                                   0.0   \n",
       "2018-07-27 17:00:00-07:00                                   0.0   \n",
       "\n",
       "                           c9404f38-e36f-303d-a878-90209307bf28  \\\n",
       "2018-07-27 14:00:00-07:00                                   2.0   \n",
       "2018-07-27 15:00:00-07:00                                   2.0   \n",
       "2018-07-27 16:00:00-07:00                                   2.0   \n",
       "2018-07-27 17:00:00-07:00                                   2.0   \n",
       "\n",
       "                           1bbcfb99-98e3-3a40-a34e-94e41eb35c57  \\\n",
       "2018-07-27 14:00:00-07:00                                   2.0   \n",
       "2018-07-27 15:00:00-07:00                                   2.0   \n",
       "2018-07-27 16:00:00-07:00                                   2.0   \n",
       "2018-07-27 17:00:00-07:00                                   2.0   \n",
       "\n",
       "                           6c8f111e-cc88-336a-8309-09d0c8b355b0  \\\n",
       "2018-07-27 14:00:00-07:00                                   0.0   \n",
       "2018-07-27 15:00:00-07:00                                   0.0   \n",
       "2018-07-27 16:00:00-07:00                                   0.0   \n",
       "2018-07-27 17:00:00-07:00                                   0.0   \n",
       "\n",
       "                           c085e817-5116-3c6f-ba9a-6882796ffa5f  \n",
       "2018-07-27 14:00:00-07:00                                   0.0  \n",
       "2018-07-27 15:00:00-07:00                                   0.0  \n",
       "2018-07-27 16:00:00-07:00                                   0.0  \n",
       "2018-07-27 17:00:00-07:00                                   0.0  "
      ]
     },
     "metadata": {},
     "output_type": "display_data"
    },
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "None\n"
     ]
    }
   ],
   "source": [
    "from xbos.services import mdal\n",
    "client = mdal.MDALClient(\"xbos/mdal\")\n",
    "SITE = str(SITE) \n",
    "\n",
    "\n",
    "###Query for Tstat State data\n",
    "queryEvent = {\n",
    "    \"Composition\": [Pegasus_Hall_State, Room_A_State, Room_D_State, Theater_1_State, Theater_2_State], # mode and state at MAX AC-1\n",
    "    \"Selectors\": [mdal.MAX, mdal.MAX, mdal.MAX, mdal.MAX, mdal.MAX], #mdal.{MAX, MIN, COUNT, MEAN, RAW} . Define one for each of the variables above\n",
    "    \"Variables\": [\n",
    "        {\"Name\": \"Back_Hallway_State\", ## \n",
    "         \"Definition\": \"SELECT ?state_uuid FROM %s WHERE { ?state rdf:type/rdfs:subClassOf* brick:Thermostat_Status . ?state bf:uuid ?state_uuid . };\" % SITE,\n",
    "        },\n",
    "        {\"Name\": \"Room_A_State\", ## \n",
    "         \"Definition\": \"SELECT ?state_uuid FROM %s WHERE { ?state rdf:type/rdfs:subClassOf* brick:Thermostat_Status . ?state bf:uuid ?state_uuid . };\" % SITE,\n",
    "        },\n",
    "        {\"Name\": \"Room_D_State\", ## \n",
    "         \"Definition\": \"SELECT ?state_uuid FROM %s WHERE { ?state rdf:type/rdfs:subClassOf* brick:Thermostat_Status . ?state bf:uuid ?state_uuid . };\" % SITE,\n",
    "        },\n",
    "        {\"Name\": \"Theater_1_State\", ## \n",
    "         \"Definition\": \"SELECT ?state_uuid FROM %s WHERE { ?state rdf:type/rdfs:subClassOf* brick:Thermostat_Status . ?state bf:uuid ?state_uuid . };\" % SITE,\n",
    "        },\n",
    "        {\"Name\": \"Theater_2_State\", ## \n",
    "         \"Definition\": \"SELECT ?state_uuid FROM %s WHERE { ?state rdf:type/rdfs:subClassOf* brick:Thermostat_Status . ?state bf:uuid ?state_uuid . };\" % SITE,\n",
    "        },\n",
    "    ],\n",
    "    \"Time\": {\n",
    "        \"T0\": \"2018-07-27 14:00:00 PDT\", ## \"T0\": 14:00:00 PDT\",\n",
    "        \"T1\": \"2018-07-27 18:00:00 PDT\", ## \"T1\": 18:00:00 PDT\",\n",
    "        \"WindowSize\": '1h', #1m, or 5m\n",
    "        \"Aligned\": True,\n",
    "    },\n",
    "}\n",
    "resp = client.do_query(queryEvent,timeout=300)\n",
    "print resp.get('error') # see if there's an error\n",
    "dfEvent = resp['df']\n",
    "print dfEvent.describe()\n",
    "display (dfEvent)\n",
    "\n",
    "#date_Event = '07_10', '07_18', '08_02', '08_07'\n",
    "\n",
    "###Query for Tstat State data\n",
    "queryComp = {\n",
    "    \"Composition\": [Pegasus_Hall_State, Room_A_State, Room_D_State, Theater_1_State, Theater_2_State], # mode and state at MAX AC-1\n",
    "    \"Selectors\": [mdal.MAX, mdal.MAX, mdal.MAX, mdal.MAX, mdal.MAX], #mdal.{MAX, MIN, COUNT, MEAN, RAW} . Define one for each of the variables above\n",
    "    \"Variables\": [\n",
    "        {\"Name\": \"Back_Hallway_State\", ## \n",
    "         \"Definition\": \"SELECT ?state_uuid FROM %s WHERE { ?state rdf:type/rdfs:subClassOf* brick:Thermostat_Status . ?state bf:uuid ?state_uuid . };\" % SITE,\n",
    "        },\n",
    "        {\"Name\": \"Room_A_State\", ## \n",
    "         \"Definition\": \"SELECT ?state_uuid FROM %s WHERE { ?state rdf:type/rdfs:subClassOf* brick:Thermostat_Status . ?state bf:uuid ?state_uuid . };\" % SITE,\n",
    "        },\n",
    "        {\"Name\": \"Room_D_State\", ## \n",
    "         \"Definition\": \"SELECT ?state_uuid FROM %s WHERE { ?state rdf:type/rdfs:subClassOf* brick:Thermostat_Status . ?state bf:uuid ?state_uuid . };\" % SITE,\n",
    "        },\n",
    "        {\"Name\": \"Theater_1_State\", ## \n",
    "         \"Definition\": \"SELECT ?state_uuid FROM %s WHERE { ?state rdf:type/rdfs:subClassOf* brick:Thermostat_Status . ?state bf:uuid ?state_uuid . };\" % SITE,\n",
    "        },\n",
    "        {\"Name\": \"Theater_2_State\", ## \n",
    "         \"Definition\": \"SELECT ?state_uuid FROM %s WHERE { ?state rdf:type/rdfs:subClassOf* brick:Thermostat_Status . ?state bf:uuid ?state_uuid . };\" % SITE,\n",
    "        },\n",
    "    ],\n",
    "    \"Time\": {\n",
    "        \"T0\": \"2018-07-18 14:00:00 PDT\", ## \"T0\": 14:00:00 PDT\",\n",
    "        \"T1\": \"2018-07-18 18:00:00 PDT\", ## \"T1\": 18:00:00 PDT\",\n",
    "        \"WindowSize\": '1h', #1m, or 5m\n",
    "        \"Aligned\": True,\n",
    "    },\n",
    "}\n",
    "resp = client.do_query(queryComp,timeout=300)\n",
    "print resp.get('error') # see if there's an error\n",
    "dfComp = resp['df']\n",
    "#print dfComp.describe()\n",
    "#display (dfComp)\n"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 6,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Saw [xbos/mdal] MDAL 4 seconds 393.69 ms ago\n",
      "None\n",
      "       ea827a42-e6b9-3e0a-970f-c3a96f0ebea3\n",
      "count                             16.000000\n",
      "mean                            4070.025983\n",
      "std                              356.143286\n",
      "min                             3514.035088\n",
      "25%                             3737.314352\n",
      "50%                             4124.603350\n",
      "75%                             4329.440582\n",
      "max                             4667.142857\n",
      "None\n",
      "       68e04192-e924-36b8-9c5e-f072bd93ed07\n",
      "count                                   0.0\n",
      "mean                                    NaN\n",
      "std                                     NaN\n",
      "min                                     NaN\n",
      "25%                                     NaN\n",
      "50%                                     NaN\n",
      "75%                                     NaN\n",
      "max                                     NaN\n"
     ]
    }
   ],
   "source": [
    "from xbos.services import mdal\n",
    "client = mdal.MDALClient(\"xbos/mdal\")\n",
    "SITE = str(SITE) \n",
    "Demand = 'ea827a42-e6b9-3e0a-970f-c3a96f0ebea3'  #meter_0xd8d5b9000000b405\n",
    "Green_Btn = '68e04192-e924-36b8-9c5e-f072bd93ed07'  #green_button_meter_ekhaL7K1ZWy7yOfRpEIBOcC3v8Y=\n",
    "###Query for Event Meter Demand\n",
    "queryEventDemand = {\n",
    "    \"Composition\": [Demand], # mode and state at MAX\n",
    "    \"Selectors\": [mdal.MEAN], #mdal.{MAX, MIN, COUNT, MEAN, RAW} . Define one for each of the variables above\n",
    "    \"Variables\": [\n",
    "        {\n",
    "         \"Name\": \"demand\",\n",
    "         \"Definition\": \"SELECT ?demand_uuid FROM %s WHERE { ?demand rdf:type/rdfs:subClassOf* brick:Electric_Meter . ?demand bf:uuid ?demand_uuid . };\" % SITE,\n",
    "        },\n",
    "    ],\n",
    "    \"Time\": {\n",
    "        \"T0\": \"2018-07-27 14:00:00 PDT\",\n",
    "        \"T1\": \"2018-07-27 18:00:00 PDT\",\n",
    "        \"WindowSize\": '15m',\n",
    "        \"Aligned\": True,\n",
    "    },\n",
    "}\n",
    "resp = client.do_query(queryEventDemand,timeout=300)\n",
    "print resp.get('error') # see if there's an error\n",
    "event_demand = resp['df']\n",
    "print event_demand.describe()\n",
    "\n",
    "###Query for Baseline Meter Demand\n",
    "queryBaselineDemand = {\n",
    "    \"Composition\": [Green_Btn], # mode and state at MAX\n",
    "    \"Selectors\": [mdal.MEAN], #mdal.{MAX, MIN, COUNT, MEAN, RAW} . Define one for each of the variables above\n",
    "    \"Variables\": [\n",
    "        {\n",
    "         \"Name\": \"green_btn\",\n",
    "         \"Definition\": \"SELECT ?demand_uuid FROM %s WHERE { ?demand rdf:type/rdfs:subClassOf* brick:Electric_Meter . ?demand bf:uuid ?demand_uuid . };\" % SITE,\n",
    "        },\n",
    "    ],\n",
    "    \"Time\": {\n",
    "        \"T0\": \"2018-07-18 14:00:00 PDT\",\n",
    "        \"T1\": \"2018-07-18 18:00:00 PDT\",\n",
    "        \"WindowSize\": '15m',\n",
    "        \"Aligned\": True,\n",
    "    },\n",
    "}\n",
    "resp = client.do_query(queryBaselineDemand,timeout=300)\n",
    "print resp.get('error') # see if there's an error\n",
    "baseline_demand = resp['df']\n",
    "print baseline_demand.describe()"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 7,
   "metadata": {
    "scrolled": true
   },
   "outputs": [
    {
     "data": {
      "text/html": [
       "<div>\n",
       "<style scoped>\n",
       "    .dataframe tbody tr th:only-of-type {\n",
       "        vertical-align: middle;\n",
       "    }\n",
       "\n",
       "    .dataframe tbody tr th {\n",
       "        vertical-align: top;\n",
       "    }\n",
       "\n",
       "    .dataframe thead th {\n",
       "        text-align: right;\n",
       "    }\n",
       "</style>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "      <th>?state</th>\n",
       "      <th>?state_uuid</th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "    <tr>\n",
       "      <th>0</th>\n",
       "      <td>HVAC_Zone_Room_A_tstat_state</td>\n",
       "      <td>c9404f38-e36f-303d-a878-90209307bf28</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>1</th>\n",
       "      <td>HVAC_Zone_Theater_2_tstat_state</td>\n",
       "      <td>c085e817-5116-3c6f-ba9a-6882796ffa5f</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>2</th>\n",
       "      <td>HVAC_Zone_Pegasus_Hall_tstat_state</td>\n",
       "      <td>8c252f6f-accf-3a28-ac71-18cd9e745272</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>3</th>\n",
       "      <td>HVAC_Zone_Theater_1_tstat_state</td>\n",
       "      <td>6c8f111e-cc88-336a-8309-09d0c8b355b0</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>4</th>\n",
       "      <td>HVAC_Zone_Room_D_tstat_state</td>\n",
       "      <td>1bbcfb99-98e3-3a40-a34e-94e41eb35c57</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>5</th>\n",
       "      <td>HVAC_Zone_Main_Hallway_tstat_state</td>\n",
       "      <td>c876fc25-2499-3357-9b94-387d5227b4a4</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>6</th>\n",
       "      <td>HVAC_Zone_Back_Hallway_tstat_state</td>\n",
       "      <td>8285a29c-dcc5-305a-bb9d-8a2653173e75</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>7</th>\n",
       "      <td>HVAC_Zone_Lobby_tstat_state</td>\n",
       "      <td>812903c9-624e-32e8-a7e1-bbf207c5eba0</td>\n",
       "    </tr>\n",
       "  </tbody>\n",
       "</table>\n",
       "</div>"
      ],
      "text/plain": [
       "                               ?state                           ?state_uuid\n",
       "0        HVAC_Zone_Room_A_tstat_state  c9404f38-e36f-303d-a878-90209307bf28\n",
       "1     HVAC_Zone_Theater_2_tstat_state  c085e817-5116-3c6f-ba9a-6882796ffa5f\n",
       "2  HVAC_Zone_Pegasus_Hall_tstat_state  8c252f6f-accf-3a28-ac71-18cd9e745272\n",
       "3     HVAC_Zone_Theater_1_tstat_state  6c8f111e-cc88-336a-8309-09d0c8b355b0\n",
       "4        HVAC_Zone_Room_D_tstat_state  1bbcfb99-98e3-3a40-a34e-94e41eb35c57\n",
       "5  HVAC_Zone_Main_Hallway_tstat_state  c876fc25-2499-3357-9b94-387d5227b4a4\n",
       "6  HVAC_Zone_Back_Hallway_tstat_state  8285a29c-dcc5-305a-bb9d-8a2653173e75\n",
       "7         HVAC_Zone_Lobby_tstat_state  812903c9-624e-32e8-a7e1-bbf207c5eba0"
      ]
     },
     "metadata": {},
     "output_type": "display_data"
    }
   ],
   "source": [
    "tstat_STATE = pd.DataFrame(list(state_res['Rows']))\n",
    "\n",
    "display (tstat_STATE)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 8,
   "metadata": {
    "scrolled": true
   },
   "outputs": [
    {
     "data": {
      "text/html": [
       "<div>\n",
       "<style scoped>\n",
       "    .dataframe tbody tr th:only-of-type {\n",
       "        vertical-align: middle;\n",
       "    }\n",
       "\n",
       "    .dataframe tbody tr th {\n",
       "        vertical-align: top;\n",
       "    }\n",
       "\n",
       "    .dataframe thead th {\n",
       "        text-align: right;\n",
       "    }\n",
       "</style>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "      <th>?state</th>\n",
       "      <th>?state_uuid</th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "    <tr>\n",
       "      <th>0</th>\n",
       "      <td>HVAC_Zone_Back_Hallway_tstat_state</td>\n",
       "      <td>8285a29c-dcc5-305a-bb9d-8a2653173e75</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>1</th>\n",
       "      <td>HVAC_Zone_Lobby_tstat_state</td>\n",
       "      <td>812903c9-624e-32e8-a7e1-bbf207c5eba0</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>2</th>\n",
       "      <td>HVAC_Zone_Main_Hallway_tstat_state</td>\n",
       "      <td>c876fc25-2499-3357-9b94-387d5227b4a4</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>3</th>\n",
       "      <td>HVAC_Zone_Pegasus_Hall_tstat_state</td>\n",
       "      <td>8c252f6f-accf-3a28-ac71-18cd9e745272</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>4</th>\n",
       "      <td>HVAC_Zone_Room_A_tstat_state</td>\n",
       "      <td>c9404f38-e36f-303d-a878-90209307bf28</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>5</th>\n",
       "      <td>HVAC_Zone_Room_D_tstat_state</td>\n",
       "      <td>1bbcfb99-98e3-3a40-a34e-94e41eb35c57</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>6</th>\n",
       "      <td>HVAC_Zone_Theater_1_tstat_state</td>\n",
       "      <td>6c8f111e-cc88-336a-8309-09d0c8b355b0</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>7</th>\n",
       "      <td>HVAC_Zone_Theater_2_tstat_state</td>\n",
       "      <td>c085e817-5116-3c6f-ba9a-6882796ffa5f</td>\n",
       "    </tr>\n",
       "  </tbody>\n",
       "</table>\n",
       "</div>"
      ],
      "text/plain": [
       "                               ?state                           ?state_uuid\n",
       "0  HVAC_Zone_Back_Hallway_tstat_state  8285a29c-dcc5-305a-bb9d-8a2653173e75\n",
       "1         HVAC_Zone_Lobby_tstat_state  812903c9-624e-32e8-a7e1-bbf207c5eba0\n",
       "2  HVAC_Zone_Main_Hallway_tstat_state  c876fc25-2499-3357-9b94-387d5227b4a4\n",
       "3  HVAC_Zone_Pegasus_Hall_tstat_state  8c252f6f-accf-3a28-ac71-18cd9e745272\n",
       "4        HVAC_Zone_Room_A_tstat_state  c9404f38-e36f-303d-a878-90209307bf28\n",
       "5        HVAC_Zone_Room_D_tstat_state  1bbcfb99-98e3-3a40-a34e-94e41eb35c57\n",
       "6     HVAC_Zone_Theater_1_tstat_state  6c8f111e-cc88-336a-8309-09d0c8b355b0\n",
       "7     HVAC_Zone_Theater_2_tstat_state  c085e817-5116-3c6f-ba9a-6882796ffa5f"
      ]
     },
     "metadata": {},
     "output_type": "display_data"
    }
   ],
   "source": [
    "##Sort column ?state to get the right order of tstat names\n",
    "tstat_STATE.sort_values(by=['?state'], inplace=True, ascending = True)\n",
    "tstat_STATE = tstat_STATE.reset_index(drop=True)\n",
    "\n",
    "display (tstat_STATE)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 9,
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/html": [
       "<div>\n",
       "<style scoped>\n",
       "    .dataframe tbody tr th:only-of-type {\n",
       "        vertical-align: middle;\n",
       "    }\n",
       "\n",
       "    .dataframe tbody tr th {\n",
       "        vertical-align: top;\n",
       "    }\n",
       "\n",
       "    .dataframe thead th {\n",
       "        text-align: right;\n",
       "    }\n",
       "</style>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "      <th>?state</th>\n",
       "      <th>?state_uuid</th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "    <tr>\n",
       "      <th>3</th>\n",
       "      <td>HVAC_Zone_Pegasus_Hall_tstat_state</td>\n",
       "      <td>8c252f6f-accf-3a28-ac71-18cd9e745272</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>4</th>\n",
       "      <td>HVAC_Zone_Room_A_tstat_state</td>\n",
       "      <td>c9404f38-e36f-303d-a878-90209307bf28</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>5</th>\n",
       "      <td>HVAC_Zone_Room_D_tstat_state</td>\n",
       "      <td>1bbcfb99-98e3-3a40-a34e-94e41eb35c57</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>6</th>\n",
       "      <td>HVAC_Zone_Theater_1_tstat_state</td>\n",
       "      <td>6c8f111e-cc88-336a-8309-09d0c8b355b0</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>7</th>\n",
       "      <td>HVAC_Zone_Theater_2_tstat_state</td>\n",
       "      <td>c085e817-5116-3c6f-ba9a-6882796ffa5f</td>\n",
       "    </tr>\n",
       "  </tbody>\n",
       "</table>\n",
       "</div>"
      ],
      "text/plain": [
       "                               ?state                           ?state_uuid\n",
       "3  HVAC_Zone_Pegasus_Hall_tstat_state  8c252f6f-accf-3a28-ac71-18cd9e745272\n",
       "4        HVAC_Zone_Room_A_tstat_state  c9404f38-e36f-303d-a878-90209307bf28\n",
       "5        HVAC_Zone_Room_D_tstat_state  1bbcfb99-98e3-3a40-a34e-94e41eb35c57\n",
       "6     HVAC_Zone_Theater_1_tstat_state  6c8f111e-cc88-336a-8309-09d0c8b355b0\n",
       "7     HVAC_Zone_Theater_2_tstat_state  c085e817-5116-3c6f-ba9a-6882796ffa5f"
      ]
     },
     "metadata": {},
     "output_type": "display_data"
    }
   ],
   "source": [
    "##Select items based on location when they are non-consecutive\n",
    "zone_list = tstat_STATE.loc[[3, 4, 5, 6, 7]] #[16, 3, 0, 5, 12] for CSU-DH\n",
    "display (zone_list)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 10,
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/html": [
       "<div>\n",
       "<style scoped>\n",
       "    .dataframe tbody tr th:only-of-type {\n",
       "        vertical-align: middle;\n",
       "    }\n",
       "\n",
       "    .dataframe tbody tr th {\n",
       "        vertical-align: top;\n",
       "    }\n",
       "\n",
       "    .dataframe thead th {\n",
       "        text-align: right;\n",
       "    }\n",
       "</style>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "      <th>?state_uuid</th>\n",
       "      <th>?state</th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "    <tr>\n",
       "      <th>3</th>\n",
       "      <td>8c252f6f-accf-3a28-ac71-18cd9e745272</td>\n",
       "      <td>HVAC_Zone_Pegasus_Hall_tstat_state</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>4</th>\n",
       "      <td>c9404f38-e36f-303d-a878-90209307bf28</td>\n",
       "      <td>HVAC_Zone_Room_A_tstat_state</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>5</th>\n",
       "      <td>1bbcfb99-98e3-3a40-a34e-94e41eb35c57</td>\n",
       "      <td>HVAC_Zone_Room_D_tstat_state</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>6</th>\n",
       "      <td>6c8f111e-cc88-336a-8309-09d0c8b355b0</td>\n",
       "      <td>HVAC_Zone_Theater_1_tstat_state</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>7</th>\n",
       "      <td>c085e817-5116-3c6f-ba9a-6882796ffa5f</td>\n",
       "      <td>HVAC_Zone_Theater_2_tstat_state</td>\n",
       "    </tr>\n",
       "  </tbody>\n",
       "</table>\n",
       "</div>"
      ],
      "text/plain": [
       "                            ?state_uuid                              ?state\n",
       "3  8c252f6f-accf-3a28-ac71-18cd9e745272  HVAC_Zone_Pegasus_Hall_tstat_state\n",
       "4  c9404f38-e36f-303d-a878-90209307bf28        HVAC_Zone_Room_A_tstat_state\n",
       "5  1bbcfb99-98e3-3a40-a34e-94e41eb35c57        HVAC_Zone_Room_D_tstat_state\n",
       "6  6c8f111e-cc88-336a-8309-09d0c8b355b0     HVAC_Zone_Theater_1_tstat_state\n",
       "7  c085e817-5116-3c6f-ba9a-6882796ffa5f     HVAC_Zone_Theater_2_tstat_state"
      ]
     },
     "metadata": {},
     "output_type": "display_data"
    }
   ],
   "source": [
    "##Reorder columns \n",
    "uuid_zone = zone_list[['?state_uuid', '?state']] #\n",
    "display (uuid_zone)\n"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 11,
   "metadata": {
    "scrolled": true
   },
   "outputs": [
    {
     "data": {
      "text/plain": [
       "[('8c252f6f-accf-3a28-ac71-18cd9e745272',\n",
       "  'HVAC_Zone_Pegasus_Hall_tstat_state'),\n",
       " ('c9404f38-e36f-303d-a878-90209307bf28', 'HVAC_Zone_Room_A_tstat_state'),\n",
       " ('1bbcfb99-98e3-3a40-a34e-94e41eb35c57', 'HVAC_Zone_Room_D_tstat_state'),\n",
       " ('6c8f111e-cc88-336a-8309-09d0c8b355b0', 'HVAC_Zone_Theater_1_tstat_state'),\n",
       " ('c085e817-5116-3c6f-ba9a-6882796ffa5f', 'HVAC_Zone_Theater_2_tstat_state')]"
      ]
     },
     "execution_count": 11,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "list(uuid_zone.itertuples(index=False, name=None))"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 12,
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/plain": [
       "{'1bbcfb99-98e3-3a40-a34e-94e41eb35c57': ['HVAC_Zone_Room_D_tstat_state'],\n",
       " '6c8f111e-cc88-336a-8309-09d0c8b355b0': ['HVAC_Zone_Theater_1_tstat_state'],\n",
       " '8c252f6f-accf-3a28-ac71-18cd9e745272': ['HVAC_Zone_Pegasus_Hall_tstat_state'],\n",
       " 'c085e817-5116-3c6f-ba9a-6882796ffa5f': ['HVAC_Zone_Theater_2_tstat_state'],\n",
       " 'c9404f38-e36f-303d-a878-90209307bf28': ['HVAC_Zone_Room_A_tstat_state']}"
      ]
     },
     "execution_count": 12,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "uuid_zone.set_index('?state_uuid').T.to_dict('list') # why is list unsorted .sort_values('?state', ascending=True)\n"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 13,
   "metadata": {},
   "outputs": [],
   "source": [
    "##Rename columns as zones, based on UUID \n",
    "col_names = {'index':'DateTime', \n",
    "             '1bbcfb99-98e3-3a40-a34e-94e41eb35c57': 'HVAC_Zone_Room_D_tstat_state', \n",
    "             '6c8f111e-cc88-336a-8309-09d0c8b355b0': 'HVAC_Zone_Theater_1_tstat_state',\n",
    "             '8c252f6f-accf-3a28-ac71-18cd9e745272': 'HVAC_Zone_Pegasus_Hall_tstat_state',\n",
    "             'c085e817-5116-3c6f-ba9a-6882796ffa5f': 'HVAC_Zone_Theater_2_tstat_state',\n",
    "             'c9404f38-e36f-303d-a878-90209307bf28': 'HVAC_Zone_Room_A_tstat_state'\n",
    "} #'index':'DateTime'"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 14,
   "metadata": {},
   "outputs": [],
   "source": [
    "comp_dates = ['8/8/18', '7/5/18', '7/26/18', '6/14/18', '10/16/18', \n",
    "              '10/31/18', '7/25/18', '7/5/18', '9/14/18', '10/1/18', '9/5/18', '7/25/18']\n",
    "cpp_dates = ['7/6/18', '7/9/18', '7/10/18', '7/17/18', '7/18/18', \n",
    "             '8/1/18', '8/2/18', '8/6/18', '8/7/18', '8/9/18', '9/28/18', '10/18/18']\n",
    "\n",
    "date_Event = '07_19' #'07_06', '07_10', '07_18', '08_02', '08_07', '09_28'\n",
    "date_Comp = '08_01' #'08_08', '07_26', '10_16', '07_25', '09_14', '09_05'\n"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 15,
   "metadata": {
    "scrolled": true
   },
   "outputs": [
    {
     "data": {
      "text/html": [
       "<div>\n",
       "<style scoped>\n",
       "    .dataframe tbody tr th:only-of-type {\n",
       "        vertical-align: middle;\n",
       "    }\n",
       "\n",
       "    .dataframe tbody tr th {\n",
       "        vertical-align: top;\n",
       "    }\n",
       "\n",
       "    .dataframe thead th {\n",
       "        text-align: right;\n",
       "    }\n",
       "</style>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "      <th>index</th>\n",
       "      <th>8c252f6f-accf-3a28-ac71-18cd9e745272</th>\n",
       "      <th>c9404f38-e36f-303d-a878-90209307bf28</th>\n",
       "      <th>1bbcfb99-98e3-3a40-a34e-94e41eb35c57</th>\n",
       "      <th>6c8f111e-cc88-336a-8309-09d0c8b355b0</th>\n",
       "      <th>c085e817-5116-3c6f-ba9a-6882796ffa5f</th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "    <tr>\n",
       "      <th>0</th>\n",
       "      <td>2018-07-27 14:00:00-07:00</td>\n",
       "      <td>0.0</td>\n",
       "      <td>2.0</td>\n",
       "      <td>2.0</td>\n",
       "      <td>0.0</td>\n",
       "      <td>0.0</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>1</th>\n",
       "      <td>2018-07-27 15:00:00-07:00</td>\n",
       "      <td>0.0</td>\n",
       "      <td>2.0</td>\n",
       "      <td>2.0</td>\n",
       "      <td>0.0</td>\n",
       "      <td>0.0</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>2</th>\n",
       "      <td>2018-07-27 16:00:00-07:00</td>\n",
       "      <td>0.0</td>\n",
       "      <td>2.0</td>\n",
       "      <td>2.0</td>\n",
       "      <td>0.0</td>\n",
       "      <td>0.0</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>3</th>\n",
       "      <td>2018-07-27 17:00:00-07:00</td>\n",
       "      <td>0.0</td>\n",
       "      <td>2.0</td>\n",
       "      <td>2.0</td>\n",
       "      <td>0.0</td>\n",
       "      <td>0.0</td>\n",
       "    </tr>\n",
       "  </tbody>\n",
       "</table>\n",
       "</div>"
      ],
      "text/plain": [
       "                      index  8c252f6f-accf-3a28-ac71-18cd9e745272  \\\n",
       "0 2018-07-27 14:00:00-07:00                                   0.0   \n",
       "1 2018-07-27 15:00:00-07:00                                   0.0   \n",
       "2 2018-07-27 16:00:00-07:00                                   0.0   \n",
       "3 2018-07-27 17:00:00-07:00                                   0.0   \n",
       "\n",
       "   c9404f38-e36f-303d-a878-90209307bf28  1bbcfb99-98e3-3a40-a34e-94e41eb35c57  \\\n",
       "0                                   2.0                                   2.0   \n",
       "1                                   2.0                                   2.0   \n",
       "2                                   2.0                                   2.0   \n",
       "3                                   2.0                                   2.0   \n",
       "\n",
       "   6c8f111e-cc88-336a-8309-09d0c8b355b0  c085e817-5116-3c6f-ba9a-6882796ffa5f  \n",
       "0                                   0.0                                   0.0  \n",
       "1                                   0.0                                   0.0  \n",
       "2                                   0.0                                   0.0  \n",
       "3                                   0.0                                   0.0  "
      ]
     },
     "metadata": {},
     "output_type": "display_data"
    }
   ],
   "source": [
    "##Reset the index of df (only works one DF at a time?)\n",
    "\n",
    "df_Event = dfEvent.reset_index(drop=False) #'DateTime'\n",
    "df_Comp = dfComp.reset_index(drop=False) #'DateTime'\n",
    "display (df_Event)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 16,
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/html": [
       "<div>\n",
       "<style scoped>\n",
       "    .dataframe tbody tr th:only-of-type {\n",
       "        vertical-align: middle;\n",
       "    }\n",
       "\n",
       "    .dataframe tbody tr th {\n",
       "        vertical-align: top;\n",
       "    }\n",
       "\n",
       "    .dataframe thead th {\n",
       "        text-align: right;\n",
       "    }\n",
       "</style>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "      <th>index</th>\n",
       "      <th>8c252f6f-accf-3a28-ac71-18cd9e745272</th>\n",
       "      <th>c9404f38-e36f-303d-a878-90209307bf28</th>\n",
       "      <th>1bbcfb99-98e3-3a40-a34e-94e41eb35c57</th>\n",
       "      <th>6c8f111e-cc88-336a-8309-09d0c8b355b0</th>\n",
       "      <th>c085e817-5116-3c6f-ba9a-6882796ffa5f</th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "    <tr>\n",
       "      <th>0</th>\n",
       "      <td>2018-07-18 14:00:00-07:00</td>\n",
       "      <td>2.0</td>\n",
       "      <td>0.0</td>\n",
       "      <td>0.0</td>\n",
       "      <td>0.0</td>\n",
       "      <td>0.0</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>1</th>\n",
       "      <td>2018-07-18 15:00:00-07:00</td>\n",
       "      <td>2.0</td>\n",
       "      <td>0.0</td>\n",
       "      <td>0.0</td>\n",
       "      <td>0.0</td>\n",
       "      <td>0.0</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>2</th>\n",
       "      <td>2018-07-18 16:00:00-07:00</td>\n",
       "      <td>5.0</td>\n",
       "      <td>0.0</td>\n",
       "      <td>0.0</td>\n",
       "      <td>0.0</td>\n",
       "      <td>0.0</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>3</th>\n",
       "      <td>2018-07-18 17:00:00-07:00</td>\n",
       "      <td>2.0</td>\n",
       "      <td>0.0</td>\n",
       "      <td>0.0</td>\n",
       "      <td>0.0</td>\n",
       "      <td>0.0</td>\n",
       "    </tr>\n",
       "  </tbody>\n",
       "</table>\n",
       "</div>"
      ],
      "text/plain": [
       "                      index  8c252f6f-accf-3a28-ac71-18cd9e745272  \\\n",
       "0 2018-07-18 14:00:00-07:00                                   2.0   \n",
       "1 2018-07-18 15:00:00-07:00                                   2.0   \n",
       "2 2018-07-18 16:00:00-07:00                                   5.0   \n",
       "3 2018-07-18 17:00:00-07:00                                   2.0   \n",
       "\n",
       "   c9404f38-e36f-303d-a878-90209307bf28  1bbcfb99-98e3-3a40-a34e-94e41eb35c57  \\\n",
       "0                                   0.0                                   0.0   \n",
       "1                                   0.0                                   0.0   \n",
       "2                                   0.0                                   0.0   \n",
       "3                                   0.0                                   0.0   \n",
       "\n",
       "   6c8f111e-cc88-336a-8309-09d0c8b355b0  c085e817-5116-3c6f-ba9a-6882796ffa5f  \n",
       "0                                   0.0                                   0.0  \n",
       "1                                   0.0                                   0.0  \n",
       "2                                   0.0                                   0.0  \n",
       "3                                   0.0                                   0.0  "
      ]
     },
     "metadata": {},
     "output_type": "display_data"
    },
    {
     "data": {
      "text/html": [
       "<div>\n",
       "<style scoped>\n",
       "    .dataframe tbody tr th:only-of-type {\n",
       "        vertical-align: middle;\n",
       "    }\n",
       "\n",
       "    .dataframe tbody tr th {\n",
       "        vertical-align: top;\n",
       "    }\n",
       "\n",
       "    .dataframe thead th {\n",
       "        text-align: right;\n",
       "    }\n",
       "</style>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "      <th>DateTime</th>\n",
       "      <th>HVAC_Zone_Pegasus_Hall_tstat_state</th>\n",
       "      <th>HVAC_Zone_Room_A_tstat_state</th>\n",
       "      <th>HVAC_Zone_Room_D_tstat_state</th>\n",
       "      <th>HVAC_Zone_Theater_1_tstat_state</th>\n",
       "      <th>HVAC_Zone_Theater_2_tstat_state</th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "    <tr>\n",
       "      <th>0</th>\n",
       "      <td>2018-07-18 14:00:00-07:00</td>\n",
       "      <td>2.0</td>\n",
       "      <td>0.0</td>\n",
       "      <td>0.0</td>\n",
       "      <td>0.0</td>\n",
       "      <td>0.0</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>1</th>\n",
       "      <td>2018-07-18 15:00:00-07:00</td>\n",
       "      <td>2.0</td>\n",
       "      <td>0.0</td>\n",
       "      <td>0.0</td>\n",
       "      <td>0.0</td>\n",
       "      <td>0.0</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>2</th>\n",
       "      <td>2018-07-18 16:00:00-07:00</td>\n",
       "      <td>5.0</td>\n",
       "      <td>0.0</td>\n",
       "      <td>0.0</td>\n",
       "      <td>0.0</td>\n",
       "      <td>0.0</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>3</th>\n",
       "      <td>2018-07-18 17:00:00-07:00</td>\n",
       "      <td>2.0</td>\n",
       "      <td>0.0</td>\n",
       "      <td>0.0</td>\n",
       "      <td>0.0</td>\n",
       "      <td>0.0</td>\n",
       "    </tr>\n",
       "  </tbody>\n",
       "</table>\n",
       "</div>"
      ],
      "text/plain": [
       "                   DateTime  HVAC_Zone_Pegasus_Hall_tstat_state  \\\n",
       "0 2018-07-18 14:00:00-07:00                                 2.0   \n",
       "1 2018-07-18 15:00:00-07:00                                 2.0   \n",
       "2 2018-07-18 16:00:00-07:00                                 5.0   \n",
       "3 2018-07-18 17:00:00-07:00                                 2.0   \n",
       "\n",
       "   HVAC_Zone_Room_A_tstat_state  HVAC_Zone_Room_D_tstat_state  \\\n",
       "0                           0.0                           0.0   \n",
       "1                           0.0                           0.0   \n",
       "2                           0.0                           0.0   \n",
       "3                           0.0                           0.0   \n",
       "\n",
       "   HVAC_Zone_Theater_1_tstat_state  HVAC_Zone_Theater_2_tstat_state  \n",
       "0                              0.0                              0.0  \n",
       "1                              0.0                              0.0  \n",
       "2                              0.0                              0.0  \n",
       "3                              0.0                              0.0  "
      ]
     },
     "metadata": {},
     "output_type": "display_data"
    }
   ],
   "source": [
    "##Rename the columns \n",
    "\n",
    "for df in df_Event, df_Comp:\n",
    "    df.rename(columns=col_names, inplace=True)\n",
    "    display (df_Comp)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 17,
   "metadata": {
    "scrolled": true
   },
   "outputs": [
    {
     "data": {
      "text/html": [
       "<div>\n",
       "<style scoped>\n",
       "    .dataframe tbody tr th:only-of-type {\n",
       "        vertical-align: middle;\n",
       "    }\n",
       "\n",
       "    .dataframe tbody tr th {\n",
       "        vertical-align: top;\n",
       "    }\n",
       "\n",
       "    .dataframe thead th {\n",
       "        text-align: right;\n",
       "    }\n",
       "</style>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "      <th>DateTime</th>\n",
       "      <th>HVAC_Zone_Pegasus_Hall_tstat_state</th>\n",
       "      <th>HVAC_Zone_Room_A_tstat_state</th>\n",
       "      <th>HVAC_Zone_Room_D_tstat_state</th>\n",
       "      <th>HVAC_Zone_Theater_1_tstat_state</th>\n",
       "      <th>HVAC_Zone_Theater_2_tstat_state</th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "    <tr>\n",
       "      <th>0</th>\n",
       "      <td>2018-07-18 14:00:00-07:00</td>\n",
       "      <td>2.0</td>\n",
       "      <td>0.0</td>\n",
       "      <td>0.0</td>\n",
       "      <td>0.0</td>\n",
       "      <td>0.0</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>1</th>\n",
       "      <td>2018-07-18 15:00:00-07:00</td>\n",
       "      <td>2.0</td>\n",
       "      <td>0.0</td>\n",
       "      <td>0.0</td>\n",
       "      <td>0.0</td>\n",
       "      <td>0.0</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>2</th>\n",
       "      <td>2018-07-18 16:00:00-07:00</td>\n",
       "      <td>5.0</td>\n",
       "      <td>0.0</td>\n",
       "      <td>0.0</td>\n",
       "      <td>0.0</td>\n",
       "      <td>0.0</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>3</th>\n",
       "      <td>2018-07-18 17:00:00-07:00</td>\n",
       "      <td>2.0</td>\n",
       "      <td>0.0</td>\n",
       "      <td>0.0</td>\n",
       "      <td>0.0</td>\n",
       "      <td>0.0</td>\n",
       "    </tr>\n",
       "  </tbody>\n",
       "</table>\n",
       "</div>"
      ],
      "text/plain": [
       "                   DateTime  HVAC_Zone_Pegasus_Hall_tstat_state  \\\n",
       "0 2018-07-18 14:00:00-07:00                                 2.0   \n",
       "1 2018-07-18 15:00:00-07:00                                 2.0   \n",
       "2 2018-07-18 16:00:00-07:00                                 5.0   \n",
       "3 2018-07-18 17:00:00-07:00                                 2.0   \n",
       "\n",
       "   HVAC_Zone_Room_A_tstat_state  HVAC_Zone_Room_D_tstat_state  \\\n",
       "0                           0.0                           0.0   \n",
       "1                           0.0                           0.0   \n",
       "2                           0.0                           0.0   \n",
       "3                           0.0                           0.0   \n",
       "\n",
       "   HVAC_Zone_Theater_1_tstat_state  HVAC_Zone_Theater_2_tstat_state  \n",
       "0                              0.0                              0.0  \n",
       "1                              0.0                              0.0  \n",
       "2                              0.0                              0.0  \n",
       "3                              0.0                              0.0  "
      ]
     },
     "metadata": {},
     "output_type": "display_data"
    },
    {
     "data": {
      "text/html": [
       "<div>\n",
       "<style scoped>\n",
       "    .dataframe tbody tr th:only-of-type {\n",
       "        vertical-align: middle;\n",
       "    }\n",
       "\n",
       "    .dataframe tbody tr th {\n",
       "        vertical-align: top;\n",
       "    }\n",
       "\n",
       "    .dataframe thead th {\n",
       "        text-align: right;\n",
       "    }\n",
       "</style>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "      <th>DateTime</th>\n",
       "      <th>HVAC_Zone_Pegasus_Hall_tstat_state</th>\n",
       "      <th>HVAC_Zone_Room_A_tstat_state</th>\n",
       "      <th>HVAC_Zone_Room_D_tstat_state</th>\n",
       "      <th>HVAC_Zone_Theater_1_tstat_state</th>\n",
       "      <th>HVAC_Zone_Theater_2_tstat_state</th>\n",
       "      <th>YYYY-MM-DD</th>\n",
       "      <th>HH:MM</th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "    <tr>\n",
       "      <th>0</th>\n",
       "      <td>2018-07-18 14:00:00-07:00</td>\n",
       "      <td>2.0</td>\n",
       "      <td>0.0</td>\n",
       "      <td>0.0</td>\n",
       "      <td>0.0</td>\n",
       "      <td>0.0</td>\n",
       "      <td>2018-07-27</td>\n",
       "      <td>14:00:00</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>1</th>\n",
       "      <td>2018-07-18 15:00:00-07:00</td>\n",
       "      <td>2.0</td>\n",
       "      <td>0.0</td>\n",
       "      <td>0.0</td>\n",
       "      <td>0.0</td>\n",
       "      <td>0.0</td>\n",
       "      <td>2018-07-27</td>\n",
       "      <td>15:00:00</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>2</th>\n",
       "      <td>2018-07-18 16:00:00-07:00</td>\n",
       "      <td>5.0</td>\n",
       "      <td>0.0</td>\n",
       "      <td>0.0</td>\n",
       "      <td>0.0</td>\n",
       "      <td>0.0</td>\n",
       "      <td>2018-07-27</td>\n",
       "      <td>16:00:00</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>3</th>\n",
       "      <td>2018-07-18 17:00:00-07:00</td>\n",
       "      <td>2.0</td>\n",
       "      <td>0.0</td>\n",
       "      <td>0.0</td>\n",
       "      <td>0.0</td>\n",
       "      <td>0.0</td>\n",
       "      <td>2018-07-27</td>\n",
       "      <td>17:00:00</td>\n",
       "    </tr>\n",
       "  </tbody>\n",
       "</table>\n",
       "</div>"
      ],
      "text/plain": [
       "                   DateTime  HVAC_Zone_Pegasus_Hall_tstat_state  \\\n",
       "0 2018-07-18 14:00:00-07:00                                 2.0   \n",
       "1 2018-07-18 15:00:00-07:00                                 2.0   \n",
       "2 2018-07-18 16:00:00-07:00                                 5.0   \n",
       "3 2018-07-18 17:00:00-07:00                                 2.0   \n",
       "\n",
       "   HVAC_Zone_Room_A_tstat_state  HVAC_Zone_Room_D_tstat_state  \\\n",
       "0                           0.0                           0.0   \n",
       "1                           0.0                           0.0   \n",
       "2                           0.0                           0.0   \n",
       "3                           0.0                           0.0   \n",
       "\n",
       "   HVAC_Zone_Theater_1_tstat_state  HVAC_Zone_Theater_2_tstat_state  \\\n",
       "0                              0.0                              0.0   \n",
       "1                              0.0                              0.0   \n",
       "2                              0.0                              0.0   \n",
       "3                              0.0                              0.0   \n",
       "\n",
       "   YYYY-MM-DD     HH:MM  \n",
       "0  2018-07-27  14:00:00  \n",
       "1  2018-07-27  15:00:00  \n",
       "2  2018-07-27  16:00:00  \n",
       "3  2018-07-27  17:00:00  "
      ]
     },
     "metadata": {},
     "output_type": "display_data"
    }
   ],
   "source": [
    "##Create date and time columns and separate 'YYYY-MM-DD' from 'HH:MM'\n",
    "for df in df_Event, df_Comp:\n",
    "    df['YYYY-MM-DD'] = [x.date() for x in df_Event['DateTime']]\n",
    "    df['HH:MM'] = [x.time() for x in df_Event['DateTime']]\n",
    "    display (df_Comp)\n"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 18,
   "metadata": {
    "scrolled": true
   },
   "outputs": [
    {
     "data": {
      "text/html": [
       "<div>\n",
       "<style scoped>\n",
       "    .dataframe tbody tr th:only-of-type {\n",
       "        vertical-align: middle;\n",
       "    }\n",
       "\n",
       "    .dataframe tbody tr th {\n",
       "        vertical-align: top;\n",
       "    }\n",
       "\n",
       "    .dataframe thead th {\n",
       "        text-align: right;\n",
       "    }\n",
       "</style>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "      <th>DateTime</th>\n",
       "      <th>HVAC_Zone_Pegasus_Hall_tstat_state</th>\n",
       "      <th>HVAC_Zone_Room_A_tstat_state</th>\n",
       "      <th>HVAC_Zone_Room_D_tstat_state</th>\n",
       "      <th>HVAC_Zone_Theater_1_tstat_state</th>\n",
       "      <th>HVAC_Zone_Theater_2_tstat_state</th>\n",
       "      <th>YYYY-MM-DD</th>\n",
       "      <th>HH:MM</th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "    <tr>\n",
       "      <th>0</th>\n",
       "      <td>2018-07-27 14:00:00-07:00</td>\n",
       "      <td>0.0</td>\n",
       "      <td>2.0</td>\n",
       "      <td>2.0</td>\n",
       "      <td>0.0</td>\n",
       "      <td>0.0</td>\n",
       "      <td>2018-07-27</td>\n",
       "      <td>14:00:00</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>1</th>\n",
       "      <td>2018-07-27 15:00:00-07:00</td>\n",
       "      <td>0.0</td>\n",
       "      <td>2.0</td>\n",
       "      <td>2.0</td>\n",
       "      <td>0.0</td>\n",
       "      <td>0.0</td>\n",
       "      <td>2018-07-27</td>\n",
       "      <td>15:00:00</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>2</th>\n",
       "      <td>2018-07-27 16:00:00-07:00</td>\n",
       "      <td>0.0</td>\n",
       "      <td>2.0</td>\n",
       "      <td>2.0</td>\n",
       "      <td>0.0</td>\n",
       "      <td>0.0</td>\n",
       "      <td>2018-07-27</td>\n",
       "      <td>16:00:00</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>3</th>\n",
       "      <td>2018-07-27 17:00:00-07:00</td>\n",
       "      <td>0.0</td>\n",
       "      <td>2.0</td>\n",
       "      <td>2.0</td>\n",
       "      <td>0.0</td>\n",
       "      <td>0.0</td>\n",
       "      <td>2018-07-27</td>\n",
       "      <td>17:00:00</td>\n",
       "    </tr>\n",
       "  </tbody>\n",
       "</table>\n",
       "</div>"
      ],
      "text/plain": [
       "                   DateTime  HVAC_Zone_Pegasus_Hall_tstat_state  \\\n",
       "0 2018-07-27 14:00:00-07:00                                 0.0   \n",
       "1 2018-07-27 15:00:00-07:00                                 0.0   \n",
       "2 2018-07-27 16:00:00-07:00                                 0.0   \n",
       "3 2018-07-27 17:00:00-07:00                                 0.0   \n",
       "\n",
       "   HVAC_Zone_Room_A_tstat_state  HVAC_Zone_Room_D_tstat_state  \\\n",
       "0                           2.0                           2.0   \n",
       "1                           2.0                           2.0   \n",
       "2                           2.0                           2.0   \n",
       "3                           2.0                           2.0   \n",
       "\n",
       "   HVAC_Zone_Theater_1_tstat_state  HVAC_Zone_Theater_2_tstat_state  \\\n",
       "0                              0.0                              0.0   \n",
       "1                              0.0                              0.0   \n",
       "2                              0.0                              0.0   \n",
       "3                              0.0                              0.0   \n",
       "\n",
       "   YYYY-MM-DD     HH:MM  \n",
       "0  2018-07-27  14:00:00  \n",
       "1  2018-07-27  15:00:00  \n",
       "2  2018-07-27  16:00:00  \n",
       "3  2018-07-27  17:00:00  "
      ]
     },
     "metadata": {},
     "output_type": "display_data"
    },
    {
     "data": {
      "text/html": [
       "<div>\n",
       "<style scoped>\n",
       "    .dataframe tbody tr th:only-of-type {\n",
       "        vertical-align: middle;\n",
       "    }\n",
       "\n",
       "    .dataframe tbody tr th {\n",
       "        vertical-align: top;\n",
       "    }\n",
       "\n",
       "    .dataframe thead th {\n",
       "        text-align: right;\n",
       "    }\n",
       "</style>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "      <th>DateTime</th>\n",
       "      <th>HVAC_Zone_Pegasus_Hall_tstat_state</th>\n",
       "      <th>HVAC_Zone_Room_A_tstat_state</th>\n",
       "      <th>HVAC_Zone_Room_D_tstat_state</th>\n",
       "      <th>HVAC_Zone_Theater_1_tstat_state</th>\n",
       "      <th>HVAC_Zone_Theater_2_tstat_state</th>\n",
       "      <th>YYYY-MM-DD</th>\n",
       "      <th>HH:MM</th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "    <tr>\n",
       "      <th>0</th>\n",
       "      <td>2018-07-27 14:00:00-07:00</td>\n",
       "      <td>0.0</td>\n",
       "      <td>2.0</td>\n",
       "      <td>2.0</td>\n",
       "      <td>0.0</td>\n",
       "      <td>0.0</td>\n",
       "      <td>2018-07-27</td>\n",
       "      <td>14:00:00</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>1</th>\n",
       "      <td>2018-07-27 15:00:00-07:00</td>\n",
       "      <td>0.0</td>\n",
       "      <td>2.0</td>\n",
       "      <td>2.0</td>\n",
       "      <td>0.0</td>\n",
       "      <td>0.0</td>\n",
       "      <td>2018-07-27</td>\n",
       "      <td>15:00:00</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>2</th>\n",
       "      <td>2018-07-27 16:00:00-07:00</td>\n",
       "      <td>0.0</td>\n",
       "      <td>2.0</td>\n",
       "      <td>2.0</td>\n",
       "      <td>0.0</td>\n",
       "      <td>0.0</td>\n",
       "      <td>2018-07-27</td>\n",
       "      <td>16:00:00</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>3</th>\n",
       "      <td>2018-07-27 17:00:00-07:00</td>\n",
       "      <td>0.0</td>\n",
       "      <td>2.0</td>\n",
       "      <td>2.0</td>\n",
       "      <td>0.0</td>\n",
       "      <td>0.0</td>\n",
       "      <td>2018-07-27</td>\n",
       "      <td>17:00:00</td>\n",
       "    </tr>\n",
       "  </tbody>\n",
       "</table>\n",
       "</div>"
      ],
      "text/plain": [
       "                   DateTime  HVAC_Zone_Pegasus_Hall_tstat_state  \\\n",
       "0 2018-07-27 14:00:00-07:00                                 0.0   \n",
       "1 2018-07-27 15:00:00-07:00                                 0.0   \n",
       "2 2018-07-27 16:00:00-07:00                                 0.0   \n",
       "3 2018-07-27 17:00:00-07:00                                 0.0   \n",
       "\n",
       "   HVAC_Zone_Room_A_tstat_state  HVAC_Zone_Room_D_tstat_state  \\\n",
       "0                           2.0                           2.0   \n",
       "1                           2.0                           2.0   \n",
       "2                           2.0                           2.0   \n",
       "3                           2.0                           2.0   \n",
       "\n",
       "   HVAC_Zone_Theater_1_tstat_state  HVAC_Zone_Theater_2_tstat_state  \\\n",
       "0                              0.0                              0.0   \n",
       "1                              0.0                              0.0   \n",
       "2                              0.0                              0.0   \n",
       "3                              0.0                              0.0   \n",
       "\n",
       "   YYYY-MM-DD     HH:MM  \n",
       "0  2018-07-27  14:00:00  \n",
       "1  2018-07-27  15:00:00  \n",
       "2  2018-07-27  16:00:00  \n",
       "3  2018-07-27  17:00:00  "
      ]
     },
     "metadata": {},
     "output_type": "display_data"
    }
   ],
   "source": [
    "##Turn date and time columns in to str\n",
    "\n",
    "for df in df_Event, df_Comp:\n",
    "    df['YYYY-MM-DD'] = df['YYYY-MM-DD'].astype(str)\n",
    "    df['HH:MM'] = df['HH:MM'].astype(str)\n",
    "    display (df_Event)\n",
    "\n"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 19,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "df_08_01\n"
     ]
    }
   ],
   "source": [
    "Event = 'df_'+str(date_Event)\n",
    "Comp = 'df_'+str(date_Comp)\n",
    "print Comp"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 20,
   "metadata": {
    "scrolled": true
   },
   "outputs": [
    {
     "data": {
      "text/html": [
       "<div>\n",
       "<style scoped>\n",
       "    .dataframe tbody tr th:only-of-type {\n",
       "        vertical-align: middle;\n",
       "    }\n",
       "\n",
       "    .dataframe tbody tr th {\n",
       "        vertical-align: top;\n",
       "    }\n",
       "\n",
       "    .dataframe thead th {\n",
       "        text-align: right;\n",
       "    }\n",
       "</style>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "      <th>HH:MM</th>\n",
       "      <th>HVAC_Zone_Pegasus_Hall_tstat_state</th>\n",
       "      <th>HVAC_Zone_Room_A_tstat_state</th>\n",
       "      <th>HVAC_Zone_Room_D_tstat_state</th>\n",
       "      <th>HVAC_Zone_Theater_1_tstat_state</th>\n",
       "      <th>HVAC_Zone_Theater_2_tstat_state</th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "    <tr>\n",
       "      <th>0</th>\n",
       "      <td>14:00:00</td>\n",
       "      <td>0.0</td>\n",
       "      <td>2.0</td>\n",
       "      <td>2.0</td>\n",
       "      <td>0.0</td>\n",
       "      <td>0.0</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>1</th>\n",
       "      <td>15:00:00</td>\n",
       "      <td>0.0</td>\n",
       "      <td>2.0</td>\n",
       "      <td>2.0</td>\n",
       "      <td>0.0</td>\n",
       "      <td>0.0</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>2</th>\n",
       "      <td>16:00:00</td>\n",
       "      <td>0.0</td>\n",
       "      <td>2.0</td>\n",
       "      <td>2.0</td>\n",
       "      <td>0.0</td>\n",
       "      <td>0.0</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>3</th>\n",
       "      <td>17:00:00</td>\n",
       "      <td>0.0</td>\n",
       "      <td>2.0</td>\n",
       "      <td>2.0</td>\n",
       "      <td>0.0</td>\n",
       "      <td>0.0</td>\n",
       "    </tr>\n",
       "  </tbody>\n",
       "</table>\n",
       "</div>"
      ],
      "text/plain": [
       "      HH:MM  HVAC_Zone_Pegasus_Hall_tstat_state  HVAC_Zone_Room_A_tstat_state  \\\n",
       "0  14:00:00                                 0.0                           2.0   \n",
       "1  15:00:00                                 0.0                           2.0   \n",
       "2  16:00:00                                 0.0                           2.0   \n",
       "3  17:00:00                                 0.0                           2.0   \n",
       "\n",
       "   HVAC_Zone_Room_D_tstat_state  HVAC_Zone_Theater_1_tstat_state  \\\n",
       "0                           2.0                              0.0   \n",
       "1                           2.0                              0.0   \n",
       "2                           2.0                              0.0   \n",
       "3                           2.0                              0.0   \n",
       "\n",
       "   HVAC_Zone_Theater_2_tstat_state  \n",
       "0                              0.0  \n",
       "1                              0.0  \n",
       "2                              0.0  \n",
       "3                              0.0  "
      ]
     },
     "metadata": {},
     "output_type": "display_data"
    }
   ],
   "source": [
    "##Reorder columns \n",
    "\n",
    "Event = df_Event.iloc[:, np.r_[7, 1:6]] #[['HH:MM', 'State1 (09-28)']] # DateTime, YYYY-MM-DD\n",
    "Comp = df_Comp.iloc[:, np.r_[7, 1:6]] # DateTime, YYYY-MM-DD# 'State3 (09-11)'\n",
    "\n",
    "display (Event)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 21,
   "metadata": {
    "scrolled": true
   },
   "outputs": [
    {
     "name": "stderr",
     "output_type": "stream",
     "text": [
      "/Applications/anaconda/lib/python2.7/site-packages/pandas/core/frame.py:3790: SettingWithCopyWarning: \n",
      "A value is trying to be set on a copy of a slice from a DataFrame\n",
      "\n",
      "See the caveats in the documentation: http://pandas.pydata.org/pandas-docs/stable/indexing.html#indexing-view-versus-copy\n",
      "  downcast=downcast, **kwargs)\n"
     ]
    },
    {
     "data": {
      "text/html": [
       "<div>\n",
       "<style scoped>\n",
       "    .dataframe tbody tr th:only-of-type {\n",
       "        vertical-align: middle;\n",
       "    }\n",
       "\n",
       "    .dataframe tbody tr th {\n",
       "        vertical-align: top;\n",
       "    }\n",
       "\n",
       "    .dataframe thead th {\n",
       "        text-align: right;\n",
       "    }\n",
       "</style>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "      <th>HH:MM</th>\n",
       "      <th>HVAC_Zone_Pegasus_Hall_tstat_state</th>\n",
       "      <th>HVAC_Zone_Room_A_tstat_state</th>\n",
       "      <th>HVAC_Zone_Room_D_tstat_state</th>\n",
       "      <th>HVAC_Zone_Theater_1_tstat_state</th>\n",
       "      <th>HVAC_Zone_Theater_2_tstat_state</th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "    <tr>\n",
       "      <th>0</th>\n",
       "      <td>14:00:00</td>\n",
       "      <td>0.0</td>\n",
       "      <td>2.0</td>\n",
       "      <td>2.0</td>\n",
       "      <td>0.0</td>\n",
       "      <td>0.0</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>1</th>\n",
       "      <td>15:00:00</td>\n",
       "      <td>0.0</td>\n",
       "      <td>2.0</td>\n",
       "      <td>2.0</td>\n",
       "      <td>0.0</td>\n",
       "      <td>0.0</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>2</th>\n",
       "      <td>16:00:00</td>\n",
       "      <td>0.0</td>\n",
       "      <td>2.0</td>\n",
       "      <td>2.0</td>\n",
       "      <td>0.0</td>\n",
       "      <td>0.0</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>3</th>\n",
       "      <td>17:00:00</td>\n",
       "      <td>0.0</td>\n",
       "      <td>2.0</td>\n",
       "      <td>2.0</td>\n",
       "      <td>0.0</td>\n",
       "      <td>0.0</td>\n",
       "    </tr>\n",
       "  </tbody>\n",
       "</table>\n",
       "</div>"
      ],
      "text/plain": [
       "      HH:MM  HVAC_Zone_Pegasus_Hall_tstat_state  HVAC_Zone_Room_A_tstat_state  \\\n",
       "0  14:00:00                                 0.0                           2.0   \n",
       "1  15:00:00                                 0.0                           2.0   \n",
       "2  16:00:00                                 0.0                           2.0   \n",
       "3  17:00:00                                 0.0                           2.0   \n",
       "\n",
       "   HVAC_Zone_Room_D_tstat_state  HVAC_Zone_Theater_1_tstat_state  \\\n",
       "0                           2.0                              0.0   \n",
       "1                           2.0                              0.0   \n",
       "2                           2.0                              0.0   \n",
       "3                           2.0                              0.0   \n",
       "\n",
       "   HVAC_Zone_Theater_2_tstat_state  \n",
       "0                              0.0  \n",
       "1                              0.0  \n",
       "2                              0.0  \n",
       "3                              0.0  "
      ]
     },
     "metadata": {},
     "output_type": "display_data"
    },
    {
     "data": {
      "text/html": [
       "<div>\n",
       "<style scoped>\n",
       "    .dataframe tbody tr th:only-of-type {\n",
       "        vertical-align: middle;\n",
       "    }\n",
       "\n",
       "    .dataframe tbody tr th {\n",
       "        vertical-align: top;\n",
       "    }\n",
       "\n",
       "    .dataframe thead th {\n",
       "        text-align: right;\n",
       "    }\n",
       "</style>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "      <th>HH:MM</th>\n",
       "      <th>HVAC_Zone_Pegasus_Hall_tstat_state</th>\n",
       "      <th>HVAC_Zone_Room_A_tstat_state</th>\n",
       "      <th>HVAC_Zone_Room_D_tstat_state</th>\n",
       "      <th>HVAC_Zone_Theater_1_tstat_state</th>\n",
       "      <th>HVAC_Zone_Theater_2_tstat_state</th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "    <tr>\n",
       "      <th>0</th>\n",
       "      <td>14:00:00</td>\n",
       "      <td>2.0</td>\n",
       "      <td>0.0</td>\n",
       "      <td>0.0</td>\n",
       "      <td>0.0</td>\n",
       "      <td>0.0</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>1</th>\n",
       "      <td>15:00:00</td>\n",
       "      <td>2.0</td>\n",
       "      <td>0.0</td>\n",
       "      <td>0.0</td>\n",
       "      <td>0.0</td>\n",
       "      <td>0.0</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>2</th>\n",
       "      <td>16:00:00</td>\n",
       "      <td>5.0</td>\n",
       "      <td>0.0</td>\n",
       "      <td>0.0</td>\n",
       "      <td>0.0</td>\n",
       "      <td>0.0</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>3</th>\n",
       "      <td>17:00:00</td>\n",
       "      <td>2.0</td>\n",
       "      <td>0.0</td>\n",
       "      <td>0.0</td>\n",
       "      <td>0.0</td>\n",
       "      <td>0.0</td>\n",
       "    </tr>\n",
       "  </tbody>\n",
       "</table>\n",
       "</div>"
      ],
      "text/plain": [
       "      HH:MM  HVAC_Zone_Pegasus_Hall_tstat_state  HVAC_Zone_Room_A_tstat_state  \\\n",
       "0  14:00:00                                 2.0                           0.0   \n",
       "1  15:00:00                                 2.0                           0.0   \n",
       "2  16:00:00                                 5.0                           0.0   \n",
       "3  17:00:00                                 2.0                           0.0   \n",
       "\n",
       "   HVAC_Zone_Room_D_tstat_state  HVAC_Zone_Theater_1_tstat_state  \\\n",
       "0                           0.0                              0.0   \n",
       "1                           0.0                              0.0   \n",
       "2                           0.0                              0.0   \n",
       "3                           0.0                              0.0   \n",
       "\n",
       "   HVAC_Zone_Theater_2_tstat_state  \n",
       "0                              0.0  \n",
       "1                              0.0  \n",
       "2                              0.0  \n",
       "3                              0.0  "
      ]
     },
     "metadata": {},
     "output_type": "display_data"
    }
   ],
   "source": [
    "##Fill NaN values to find missing data\n",
    "\n",
    "for df in Event, Comp:\n",
    "    df.fillna(value=99, inplace=True) # use value 99 to find NaN\n",
    "    display (df)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 22,
   "metadata": {
    "scrolled": true
   },
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "['HH:MM', 'HVAC_Zone_Pegasus_Hall_tstat_state', 'HVAC_Zone_Room_A_tstat_state', 'HVAC_Zone_Room_D_tstat_state', 'HVAC_Zone_Theater_1_tstat_state', 'HVAC_Zone_Theater_2_tstat_state']\n"
     ]
    }
   ],
   "source": [
    "##A list of column headers if needed\n",
    "\n",
    "print Comp.columns.values.tolist()"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 23,
   "metadata": {},
   "outputs": [],
   "source": [
    "##Reset index to HH:MM\n",
    "Event.set_index('HH:MM', inplace=True) # DateTime, YYYY-MM-DD\n",
    "Comp.set_index('HH:MM', inplace=True) # DateTime, YYYY-MM-DD\n"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 24,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "[[ 0.  2.  5.]\n",
      " [16.  3.  1.]]\n"
     ]
    }
   ],
   "source": [
    "##Count unique elements for Baseline and DR Event days\n",
    "unique_elements, counts_elements = np.unique(Comp, return_counts=True)\n",
    "print(np.asarray((unique_elements, counts_elements)))"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 25,
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/plain": [
       "HVAC_Zone_Pegasus_Hall_tstat_state    4\n",
       "HVAC_Zone_Room_A_tstat_state          4\n",
       "HVAC_Zone_Room_D_tstat_state          4\n",
       "HVAC_Zone_Theater_1_tstat_state       4\n",
       "HVAC_Zone_Theater_2_tstat_state       4\n",
       "dtype: int64"
      ]
     },
     "execution_count": 25,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "##Count the number of lines in each of the dfs (1440 minutes in a 24 hour period)\n",
    "Comp.count()"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 26,
   "metadata": {
    "scrolled": true
   },
   "outputs": [
    {
     "data": {
      "text/html": [
       "<div>\n",
       "<style scoped>\n",
       "    .dataframe tbody tr th:only-of-type {\n",
       "        vertical-align: middle;\n",
       "    }\n",
       "\n",
       "    .dataframe tbody tr th {\n",
       "        vertical-align: top;\n",
       "    }\n",
       "\n",
       "    .dataframe thead th {\n",
       "        text-align: right;\n",
       "    }\n",
       "</style>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "      <th>HVAC_Zone_Pegasus_Hall_tstat_state</th>\n",
       "      <th>HVAC_Zone_Room_A_tstat_state</th>\n",
       "      <th>HVAC_Zone_Room_D_tstat_state</th>\n",
       "      <th>HVAC_Zone_Theater_1_tstat_state</th>\n",
       "      <th>HVAC_Zone_Theater_2_tstat_state</th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "    <tr>\n",
       "      <th>0.0</th>\n",
       "      <td>4.0</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "      <td>4.0</td>\n",
       "      <td>4.0</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>2.0</th>\n",
       "      <td>NaN</td>\n",
       "      <td>4.0</td>\n",
       "      <td>4.0</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "    </tr>\n",
       "  </tbody>\n",
       "</table>\n",
       "</div>"
      ],
      "text/plain": [
       "     HVAC_Zone_Pegasus_Hall_tstat_state  HVAC_Zone_Room_A_tstat_state  \\\n",
       "0.0                                 4.0                           NaN   \n",
       "2.0                                 NaN                           4.0   \n",
       "\n",
       "     HVAC_Zone_Room_D_tstat_state  HVAC_Zone_Theater_1_tstat_state  \\\n",
       "0.0                           NaN                              4.0   \n",
       "2.0                           4.0                              NaN   \n",
       "\n",
       "     HVAC_Zone_Theater_2_tstat_state  \n",
       "0.0                              4.0  \n",
       "2.0                              NaN  "
      ]
     },
     "metadata": {},
     "output_type": "display_data"
    }
   ],
   "source": [
    "##Count number of hours in each state category\n",
    "Event = Event.apply(lambda y: y.value_counts(sort=False))\n",
    "Event.index = Event.index.astype(str)\n",
    "display (Event)\n",
    "\n",
    "Event.to_csv('df_'+str(date_Event)+'.csv')"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 27,
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/html": [
       "<div>\n",
       "<style scoped>\n",
       "    .dataframe tbody tr th:only-of-type {\n",
       "        vertical-align: middle;\n",
       "    }\n",
       "\n",
       "    .dataframe tbody tr th {\n",
       "        vertical-align: top;\n",
       "    }\n",
       "\n",
       "    .dataframe thead th {\n",
       "        text-align: right;\n",
       "    }\n",
       "</style>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "      <th>HVAC_Zone_Pegasus_Hall_tstat_state</th>\n",
       "      <th>HVAC_Zone_Room_A_tstat_state</th>\n",
       "      <th>HVAC_Zone_Room_D_tstat_state</th>\n",
       "      <th>HVAC_Zone_Theater_1_tstat_state</th>\n",
       "      <th>HVAC_Zone_Theater_2_tstat_state</th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "    <tr>\n",
       "      <th>0.0</th>\n",
       "      <td>NaN</td>\n",
       "      <td>4.0</td>\n",
       "      <td>4.0</td>\n",
       "      <td>4.0</td>\n",
       "      <td>4.0</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>2.0</th>\n",
       "      <td>3.0</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>5.0</th>\n",
       "      <td>1.0</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "    </tr>\n",
       "  </tbody>\n",
       "</table>\n",
       "</div>"
      ],
      "text/plain": [
       "     HVAC_Zone_Pegasus_Hall_tstat_state  HVAC_Zone_Room_A_tstat_state  \\\n",
       "0.0                                 NaN                           4.0   \n",
       "2.0                                 3.0                           NaN   \n",
       "5.0                                 1.0                           NaN   \n",
       "\n",
       "     HVAC_Zone_Room_D_tstat_state  HVAC_Zone_Theater_1_tstat_state  \\\n",
       "0.0                           4.0                              4.0   \n",
       "2.0                           NaN                              NaN   \n",
       "5.0                           NaN                              NaN   \n",
       "\n",
       "     HVAC_Zone_Theater_2_tstat_state  \n",
       "0.0                              4.0  \n",
       "2.0                              NaN  \n",
       "5.0                              NaN  "
      ]
     },
     "metadata": {},
     "output_type": "display_data"
    }
   ],
   "source": [
    "##Count number of hours in each state category\n",
    "Comp = Comp.apply(lambda y: y.value_counts(sort=False))\n",
    "Comp.index = Comp.index.astype(str)\n",
    "display (Comp)\n",
    "\n",
    "Comp.to_csv('df_'+str(date_Comp)+'.csv')"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "##Replace NaN here with Zero (0) to prevent over counting at analysis stage!!!"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 28,
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/html": [
       "<div>\n",
       "<style scoped>\n",
       "    .dataframe tbody tr th:only-of-type {\n",
       "        vertical-align: middle;\n",
       "    }\n",
       "\n",
       "    .dataframe tbody tr th {\n",
       "        vertical-align: top;\n",
       "    }\n",
       "\n",
       "    .dataframe thead th {\n",
       "        text-align: right;\n",
       "    }\n",
       "</style>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "      <th>HVAC_Zone_Pegasus_Hall_tstat_state</th>\n",
       "      <th>HVAC_Zone_Room_A_tstat_state</th>\n",
       "      <th>HVAC_Zone_Room_D_tstat_state</th>\n",
       "      <th>HVAC_Zone_Theater_1_tstat_state</th>\n",
       "      <th>HVAC_Zone_Theater_2_tstat_state</th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "    <tr>\n",
       "      <th>0.0</th>\n",
       "      <td>4.0</td>\n",
       "      <td>0.0</td>\n",
       "      <td>0.0</td>\n",
       "      <td>4.0</td>\n",
       "      <td>4.0</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>2.0</th>\n",
       "      <td>0.0</td>\n",
       "      <td>4.0</td>\n",
       "      <td>4.0</td>\n",
       "      <td>0.0</td>\n",
       "      <td>0.0</td>\n",
       "    </tr>\n",
       "  </tbody>\n",
       "</table>\n",
       "</div>"
      ],
      "text/plain": [
       "     HVAC_Zone_Pegasus_Hall_tstat_state  HVAC_Zone_Room_A_tstat_state  \\\n",
       "0.0                                 4.0                           0.0   \n",
       "2.0                                 0.0                           4.0   \n",
       "\n",
       "     HVAC_Zone_Room_D_tstat_state  HVAC_Zone_Theater_1_tstat_state  \\\n",
       "0.0                           0.0                              4.0   \n",
       "2.0                           4.0                              0.0   \n",
       "\n",
       "     HVAC_Zone_Theater_2_tstat_state  \n",
       "0.0                              4.0  \n",
       "2.0                              0.0  "
      ]
     },
     "metadata": {},
     "output_type": "display_data"
    },
    {
     "data": {
      "text/html": [
       "<div>\n",
       "<style scoped>\n",
       "    .dataframe tbody tr th:only-of-type {\n",
       "        vertical-align: middle;\n",
       "    }\n",
       "\n",
       "    .dataframe tbody tr th {\n",
       "        vertical-align: top;\n",
       "    }\n",
       "\n",
       "    .dataframe thead th {\n",
       "        text-align: right;\n",
       "    }\n",
       "</style>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "      <th>HVAC_Zone_Pegasus_Hall_tstat_state</th>\n",
       "      <th>HVAC_Zone_Room_A_tstat_state</th>\n",
       "      <th>HVAC_Zone_Room_D_tstat_state</th>\n",
       "      <th>HVAC_Zone_Theater_1_tstat_state</th>\n",
       "      <th>HVAC_Zone_Theater_2_tstat_state</th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "    <tr>\n",
       "      <th>0.0</th>\n",
       "      <td>0.0</td>\n",
       "      <td>4.0</td>\n",
       "      <td>4.0</td>\n",
       "      <td>4.0</td>\n",
       "      <td>4.0</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>2.0</th>\n",
       "      <td>3.0</td>\n",
       "      <td>0.0</td>\n",
       "      <td>0.0</td>\n",
       "      <td>0.0</td>\n",
       "      <td>0.0</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>5.0</th>\n",
       "      <td>1.0</td>\n",
       "      <td>0.0</td>\n",
       "      <td>0.0</td>\n",
       "      <td>0.0</td>\n",
       "      <td>0.0</td>\n",
       "    </tr>\n",
       "  </tbody>\n",
       "</table>\n",
       "</div>"
      ],
      "text/plain": [
       "     HVAC_Zone_Pegasus_Hall_tstat_state  HVAC_Zone_Room_A_tstat_state  \\\n",
       "0.0                                 0.0                           4.0   \n",
       "2.0                                 3.0                           0.0   \n",
       "5.0                                 1.0                           0.0   \n",
       "\n",
       "     HVAC_Zone_Room_D_tstat_state  HVAC_Zone_Theater_1_tstat_state  \\\n",
       "0.0                           4.0                              4.0   \n",
       "2.0                           0.0                              0.0   \n",
       "5.0                           0.0                              0.0   \n",
       "\n",
       "     HVAC_Zone_Theater_2_tstat_state  \n",
       "0.0                              4.0  \n",
       "2.0                              0.0  \n",
       "5.0                              0.0  "
      ]
     },
     "metadata": {},
     "output_type": "display_data"
    }
   ],
   "source": [
    "##Fill NaN values to find missing data\n",
    "\n",
    "for df in Event, Comp:\n",
    "    df.fillna(value=0, inplace=True) # use value 99 to find NaN \n",
    "    display (df)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 29,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "df_07_19test\n"
     ]
    }
   ],
   "source": [
    "Eventa = 'df_'+str(date_Event)+'test'\n",
    "Compa = 'df_'+str(date_Comp)+'test'\n",
    "\n",
    "print Eventa"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 30,
   "metadata": {
    "scrolled": true
   },
   "outputs": [
    {
     "data": {
      "text/html": [
       "<div>\n",
       "<style scoped>\n",
       "    .dataframe tbody tr th:only-of-type {\n",
       "        vertical-align: middle;\n",
       "    }\n",
       "\n",
       "    .dataframe tbody tr th {\n",
       "        vertical-align: top;\n",
       "    }\n",
       "\n",
       "    .dataframe thead th {\n",
       "        text-align: right;\n",
       "    }\n",
       "</style>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "      <th>index</th>\n",
       "      <th>HVAC_Zone_Pegasus_Hall_tstat_state</th>\n",
       "      <th>HVAC_Zone_Room_A_tstat_state</th>\n",
       "      <th>HVAC_Zone_Room_D_tstat_state</th>\n",
       "      <th>HVAC_Zone_Theater_1_tstat_state</th>\n",
       "      <th>HVAC_Zone_Theater_2_tstat_state</th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "    <tr>\n",
       "      <th>0</th>\n",
       "      <td>0.0</td>\n",
       "      <td>0.0</td>\n",
       "      <td>4.0</td>\n",
       "      <td>4.0</td>\n",
       "      <td>4.0</td>\n",
       "      <td>4.0</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>1</th>\n",
       "      <td>2.0</td>\n",
       "      <td>3.0</td>\n",
       "      <td>0.0</td>\n",
       "      <td>0.0</td>\n",
       "      <td>0.0</td>\n",
       "      <td>0.0</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>2</th>\n",
       "      <td>5.0</td>\n",
       "      <td>1.0</td>\n",
       "      <td>0.0</td>\n",
       "      <td>0.0</td>\n",
       "      <td>0.0</td>\n",
       "      <td>0.0</td>\n",
       "    </tr>\n",
       "  </tbody>\n",
       "</table>\n",
       "</div>"
      ],
      "text/plain": [
       "  index  HVAC_Zone_Pegasus_Hall_tstat_state  HVAC_Zone_Room_A_tstat_state  \\\n",
       "0   0.0                                 0.0                           4.0   \n",
       "1   2.0                                 3.0                           0.0   \n",
       "2   5.0                                 1.0                           0.0   \n",
       "\n",
       "   HVAC_Zone_Room_D_tstat_state  HVAC_Zone_Theater_1_tstat_state  \\\n",
       "0                           4.0                              4.0   \n",
       "1                           0.0                              0.0   \n",
       "2                           0.0                              0.0   \n",
       "\n",
       "   HVAC_Zone_Theater_2_tstat_state  \n",
       "0                              4.0  \n",
       "1                              0.0  \n",
       "2                              0.0  "
      ]
     },
     "metadata": {},
     "output_type": "display_data"
    }
   ],
   "source": [
    "##reset index of new dfs to groupby and plot \n",
    "Eventa = Event.reset_index(drop=False)\n",
    "Compa = Comp.reset_index(drop=False)\n",
    "display (Compa)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 31,
   "metadata": {},
   "outputs": [],
   "source": [
    "newcol_names = {'index':'State', \n",
    "                'HVAC_Zone_Pegasus_Hall_tstat_state': 'Pegasus_Hall', \n",
    "                'HVAC_Zone_Room_A_tstat_state': 'Room_A', \n",
    "                'HVAC_Zone_Room_D_tstat_state': 'Room_D', \n",
    "                'HVAC_Zone_Theater_1_tstat_state': 'Theater_1', \n",
    "                'HVAC_Zone_Theater_2_tstat_state': 'Theater_2'\n",
    "} #'index':'DateTime'\n"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 32,
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/html": [
       "<div>\n",
       "<style scoped>\n",
       "    .dataframe tbody tr th:only-of-type {\n",
       "        vertical-align: middle;\n",
       "    }\n",
       "\n",
       "    .dataframe tbody tr th {\n",
       "        vertical-align: top;\n",
       "    }\n",
       "\n",
       "    .dataframe thead th {\n",
       "        text-align: right;\n",
       "    }\n",
       "</style>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "      <th>State</th>\n",
       "      <th>Pegasus_Hall</th>\n",
       "      <th>Room_A</th>\n",
       "      <th>Room_D</th>\n",
       "      <th>Theater_1</th>\n",
       "      <th>Theater_2</th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "    <tr>\n",
       "      <th>0</th>\n",
       "      <td>0.0</td>\n",
       "      <td>4.0</td>\n",
       "      <td>0.0</td>\n",
       "      <td>0.0</td>\n",
       "      <td>4.0</td>\n",
       "      <td>4.0</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>1</th>\n",
       "      <td>2.0</td>\n",
       "      <td>0.0</td>\n",
       "      <td>4.0</td>\n",
       "      <td>4.0</td>\n",
       "      <td>0.0</td>\n",
       "      <td>0.0</td>\n",
       "    </tr>\n",
       "  </tbody>\n",
       "</table>\n",
       "</div>"
      ],
      "text/plain": [
       "  State  Pegasus_Hall  Room_A  Room_D  Theater_1  Theater_2\n",
       "0   0.0           4.0     0.0     0.0        4.0        4.0\n",
       "1   2.0           0.0     4.0     4.0        0.0        0.0"
      ]
     },
     "metadata": {},
     "output_type": "display_data"
    }
   ],
   "source": [
    "##Rename new columns for plotting\n",
    "Eventa.rename(columns = newcol_names, inplace=True)\n",
    "Compa.rename(columns = newcol_names, inplace=True)\n",
    "\n",
    "#df = df.apply(pd.to_numeric)\n",
    "\n",
    "#df_09_28new = df_09_28test.rename(columns=newcol_names, inplace=True)\n",
    "display (Eventa)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 33,
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/html": [
       "<div>\n",
       "<style scoped>\n",
       "    .dataframe tbody tr th:only-of-type {\n",
       "        vertical-align: middle;\n",
       "    }\n",
       "\n",
       "    .dataframe tbody tr th {\n",
       "        vertical-align: top;\n",
       "    }\n",
       "\n",
       "    .dataframe thead th {\n",
       "        text-align: right;\n",
       "    }\n",
       "</style>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "      <th>State</th>\n",
       "      <th>Pegasus_Hall</th>\n",
       "      <th>Room_A</th>\n",
       "      <th>Room_D</th>\n",
       "      <th>Theater_1</th>\n",
       "      <th>Theater_2</th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "    <tr>\n",
       "      <th>0</th>\n",
       "      <td>0</td>\n",
       "      <td>0</td>\n",
       "      <td>4</td>\n",
       "      <td>4</td>\n",
       "      <td>4</td>\n",
       "      <td>4</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>1</th>\n",
       "      <td>2</td>\n",
       "      <td>3</td>\n",
       "      <td>0</td>\n",
       "      <td>0</td>\n",
       "      <td>0</td>\n",
       "      <td>0</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>2</th>\n",
       "      <td>5</td>\n",
       "      <td>1</td>\n",
       "      <td>0</td>\n",
       "      <td>0</td>\n",
       "      <td>0</td>\n",
       "      <td>0</td>\n",
       "    </tr>\n",
       "  </tbody>\n",
       "</table>\n",
       "</div>"
      ],
      "text/plain": [
       "   State  Pegasus_Hall  Room_A  Room_D  Theater_1  Theater_2\n",
       "0      0             0       4       4          4          4\n",
       "1      2             3       0       0          0          0\n",
       "2      5             1       0       0          0          0"
      ]
     },
     "execution_count": 33,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "##Make all numbers int\n",
    "Eventa = Eventa.apply(pd.to_numeric, errors='ignore').astype(int)\n",
    "Compa = Compa.apply(pd.to_numeric, errors='ignore').astype(int)\n",
    "#display (df_10_02test)\n",
    "Compa"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 34,
   "metadata": {
    "scrolled": true
   },
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "['State', 'Pegasus_Hall', 'Room_A', 'Room_D', 'Theater_1', 'Theater_2']\n"
     ]
    }
   ],
   "source": [
    "print Eventa.columns.values.tolist()"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 35,
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/html": [
       "<div>\n",
       "<style scoped>\n",
       "    .dataframe tbody tr th:only-of-type {\n",
       "        vertical-align: middle;\n",
       "    }\n",
       "\n",
       "    .dataframe tbody tr th {\n",
       "        vertical-align: top;\n",
       "    }\n",
       "\n",
       "    .dataframe thead th {\n",
       "        text-align: right;\n",
       "    }\n",
       "</style>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "      <th>State</th>\n",
       "      <th>Pegasus_Hall</th>\n",
       "      <th>Room_A</th>\n",
       "      <th>Room_D</th>\n",
       "      <th>Theater_1</th>\n",
       "      <th>Theater_2</th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "    <tr>\n",
       "      <th>0</th>\n",
       "      <td>0</td>\n",
       "      <td>0</td>\n",
       "      <td>0</td>\n",
       "      <td>0</td>\n",
       "      <td>0</td>\n",
       "      <td>0</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>1</th>\n",
       "      <td>1</td>\n",
       "      <td>0</td>\n",
       "      <td>0</td>\n",
       "      <td>0</td>\n",
       "      <td>0</td>\n",
       "      <td>0</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>2</th>\n",
       "      <td>2</td>\n",
       "      <td>0</td>\n",
       "      <td>0</td>\n",
       "      <td>0</td>\n",
       "      <td>0</td>\n",
       "      <td>0</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>3</th>\n",
       "      <td>3</td>\n",
       "      <td>0</td>\n",
       "      <td>0</td>\n",
       "      <td>0</td>\n",
       "      <td>0</td>\n",
       "      <td>0</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>4</th>\n",
       "      <td>4</td>\n",
       "      <td>0</td>\n",
       "      <td>0</td>\n",
       "      <td>0</td>\n",
       "      <td>0</td>\n",
       "      <td>0</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>5</th>\n",
       "      <td>5</td>\n",
       "      <td>0</td>\n",
       "      <td>0</td>\n",
       "      <td>0</td>\n",
       "      <td>0</td>\n",
       "      <td>0</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>6</th>\n",
       "      <td>99</td>\n",
       "      <td>0</td>\n",
       "      <td>0</td>\n",
       "      <td>0</td>\n",
       "      <td>0</td>\n",
       "      <td>0</td>\n",
       "    </tr>\n",
       "  </tbody>\n",
       "</table>\n",
       "</div>"
      ],
      "text/plain": [
       "   State  Pegasus_Hall  Room_A  Room_D  Theater_1  Theater_2\n",
       "0      0             0       0       0          0          0\n",
       "1      1             0       0       0          0          0\n",
       "2      2             0       0       0          0          0\n",
       "3      3             0       0       0          0          0\n",
       "4      4             0       0       0          0          0\n",
       "5      5             0       0       0          0          0\n",
       "6     99             0       0       0          0          0"
      ]
     },
     "metadata": {},
     "output_type": "display_data"
    }
   ],
   "source": [
    "##Add new rows and sort\n",
    "\n",
    "column_head = Eventa.columns.values.tolist()\n",
    "\n",
    "s0 = pd.Series([0.0, 0, 0, 0, 0, 0])\n",
    "s1 = pd.Series([1.0, 0, 0, 0, 0, 0])\n",
    "s2 = pd.Series([2.0, 0, 0, 0, 0, 0])\n",
    "s3 = pd.Series([3.0, 0, 0, 0, 0, 0])\n",
    "s4 = pd.Series([4.0, 0, 0, 0, 0, 0])\n",
    "s5 = pd.Series([5.0, 0, 0, 0, 0, 0])\n",
    "s6 = pd.Series([99.0, 0, 0, 0, 0, 0])\n",
    "\n",
    "df_3rows = pd.DataFrame([list(s1), list(s2), list(s3)],  columns = column_head).astype(int)\n",
    "df_4rows = pd.DataFrame([list(s1), list(s2), list(s3), list(s4)],  columns = column_head).astype(int)\n",
    "df_6rows = pd.DataFrame([list(s0), list(s1), list(s2), list(s3), list(s4), list(s5), list(s6)],  columns = column_head).astype(int)\n",
    "\n",
    "display (df_6rows)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 36,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "df_07_19_final\n"
     ]
    }
   ],
   "source": [
    "fin_Eventa = 'df_'+str(date_Event)+'_final'\n",
    "fin_Compa = 'df_'+str(date_Comp)+'_final'\n",
    "\n",
    "print fin_Eventa"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 37,
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/html": [
       "<div>\n",
       "<style scoped>\n",
       "    .dataframe tbody tr th:only-of-type {\n",
       "        vertical-align: middle;\n",
       "    }\n",
       "\n",
       "    .dataframe tbody tr th {\n",
       "        vertical-align: top;\n",
       "    }\n",
       "\n",
       "    .dataframe thead th {\n",
       "        text-align: right;\n",
       "    }\n",
       "</style>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "      <th>State</th>\n",
       "      <th>Pegasus_Hall</th>\n",
       "      <th>Room_A</th>\n",
       "      <th>Room_D</th>\n",
       "      <th>Theater_1</th>\n",
       "      <th>Theater_2</th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "    <tr>\n",
       "      <th>0</th>\n",
       "      <td>0</td>\n",
       "      <td>4</td>\n",
       "      <td>0</td>\n",
       "      <td>0</td>\n",
       "      <td>4</td>\n",
       "      <td>4</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>1</th>\n",
       "      <td>1</td>\n",
       "      <td>0</td>\n",
       "      <td>0</td>\n",
       "      <td>0</td>\n",
       "      <td>0</td>\n",
       "      <td>0</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>2</th>\n",
       "      <td>2</td>\n",
       "      <td>0</td>\n",
       "      <td>4</td>\n",
       "      <td>4</td>\n",
       "      <td>0</td>\n",
       "      <td>0</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>3</th>\n",
       "      <td>3</td>\n",
       "      <td>0</td>\n",
       "      <td>0</td>\n",
       "      <td>0</td>\n",
       "      <td>0</td>\n",
       "      <td>0</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>4</th>\n",
       "      <td>4</td>\n",
       "      <td>0</td>\n",
       "      <td>0</td>\n",
       "      <td>0</td>\n",
       "      <td>0</td>\n",
       "      <td>0</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>5</th>\n",
       "      <td>5</td>\n",
       "      <td>0</td>\n",
       "      <td>0</td>\n",
       "      <td>0</td>\n",
       "      <td>0</td>\n",
       "      <td>0</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>6</th>\n",
       "      <td>99</td>\n",
       "      <td>0</td>\n",
       "      <td>0</td>\n",
       "      <td>0</td>\n",
       "      <td>0</td>\n",
       "      <td>0</td>\n",
       "    </tr>\n",
       "  </tbody>\n",
       "</table>\n",
       "</div>"
      ],
      "text/plain": [
       "   State  Pegasus_Hall  Room_A  Room_D  Theater_1  Theater_2\n",
       "0      0             4       0       0          4          4\n",
       "1      1             0       0       0          0          0\n",
       "2      2             0       4       4          0          0\n",
       "3      3             0       0       0          0          0\n",
       "4      4             0       0       0          0          0\n",
       "5      5             0       0       0          0          0\n",
       "6     99             0       0       0          0          0"
      ]
     },
     "metadata": {},
     "output_type": "display_data"
    }
   ],
   "source": [
    "##Merge new dfs to make a final df  \n",
    "\n",
    "fin_Eventa = df_6rows.merge(Eventa, on=list(df_4rows), how='outer')\n",
    "fin_Eventa.drop_duplicates(subset='State', inplace=True, keep='last')\n",
    "fin_Eventa.sort_values('State', inplace=True)\n",
    "fin_Eventa = fin_Eventa.reset_index(drop=True)\n",
    "display (fin_Eventa)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 38,
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/html": [
       "<div>\n",
       "<style scoped>\n",
       "    .dataframe tbody tr th:only-of-type {\n",
       "        vertical-align: middle;\n",
       "    }\n",
       "\n",
       "    .dataframe tbody tr th {\n",
       "        vertical-align: top;\n",
       "    }\n",
       "\n",
       "    .dataframe thead th {\n",
       "        text-align: right;\n",
       "    }\n",
       "</style>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "      <th>State</th>\n",
       "      <th>Pegasus_Hall</th>\n",
       "      <th>Room_A</th>\n",
       "      <th>Room_D</th>\n",
       "      <th>Theater_1</th>\n",
       "      <th>Theater_2</th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "    <tr>\n",
       "      <th>0</th>\n",
       "      <td>0</td>\n",
       "      <td>0</td>\n",
       "      <td>4</td>\n",
       "      <td>4</td>\n",
       "      <td>4</td>\n",
       "      <td>4</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>1</th>\n",
       "      <td>1</td>\n",
       "      <td>0</td>\n",
       "      <td>0</td>\n",
       "      <td>0</td>\n",
       "      <td>0</td>\n",
       "      <td>0</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>2</th>\n",
       "      <td>2</td>\n",
       "      <td>3</td>\n",
       "      <td>0</td>\n",
       "      <td>0</td>\n",
       "      <td>0</td>\n",
       "      <td>0</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>3</th>\n",
       "      <td>3</td>\n",
       "      <td>0</td>\n",
       "      <td>0</td>\n",
       "      <td>0</td>\n",
       "      <td>0</td>\n",
       "      <td>0</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>4</th>\n",
       "      <td>4</td>\n",
       "      <td>0</td>\n",
       "      <td>0</td>\n",
       "      <td>0</td>\n",
       "      <td>0</td>\n",
       "      <td>0</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>5</th>\n",
       "      <td>5</td>\n",
       "      <td>1</td>\n",
       "      <td>0</td>\n",
       "      <td>0</td>\n",
       "      <td>0</td>\n",
       "      <td>0</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>6</th>\n",
       "      <td>99</td>\n",
       "      <td>0</td>\n",
       "      <td>0</td>\n",
       "      <td>0</td>\n",
       "      <td>0</td>\n",
       "      <td>0</td>\n",
       "    </tr>\n",
       "  </tbody>\n",
       "</table>\n",
       "</div>"
      ],
      "text/plain": [
       "   State  Pegasus_Hall  Room_A  Room_D  Theater_1  Theater_2\n",
       "0      0             0       4       4          4          4\n",
       "1      1             0       0       0          0          0\n",
       "2      2             3       0       0          0          0\n",
       "3      3             0       0       0          0          0\n",
       "4      4             0       0       0          0          0\n",
       "5      5             1       0       0          0          0\n",
       "6     99             0       0       0          0          0"
      ]
     },
     "metadata": {},
     "output_type": "display_data"
    }
   ],
   "source": [
    "##Merge new dfs to make a final df  \n",
    "\n",
    "fin_Compa = df_6rows.merge(Compa, on=list(df_4rows), how='outer')\n",
    "fin_Compa.drop_duplicates(subset='State', inplace=True, keep='last')\n",
    "fin_Compa.sort_values('State', inplace=True)\n",
    "fin_Compa = fin_Compa.reset_index(drop=True)\n",
    "display (fin_Compa)\n",
    "\n"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "##Start of New Analysis Code"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 39,
   "metadata": {
    "scrolled": true
   },
   "outputs": [
    {
     "name": "stderr",
     "output_type": "stream",
     "text": [
      "/Applications/anaconda/lib/python2.7/site-packages/pandas/core/frame.py:3781: SettingWithCopyWarning: \n",
      "A value is trying to be set on a copy of a slice from a DataFrame\n",
      "\n",
      "See the caveats in the documentation: http://pandas.pydata.org/pandas-docs/stable/indexing.html#indexing-view-versus-copy\n",
      "  return super(DataFrame, self).rename(**kwargs)\n",
      "/Applications/anaconda/lib/python2.7/site-packages/pandas/core/frame.py:3697: SettingWithCopyWarning: \n",
      "A value is trying to be set on a copy of a slice from a DataFrame\n",
      "\n",
      "See the caveats in the documentation: http://pandas.pydata.org/pandas-docs/stable/indexing.html#indexing-view-versus-copy\n",
      "  errors=errors)\n"
     ]
    },
    {
     "data": {
      "text/html": [
       "<div>\n",
       "<style scoped>\n",
       "    .dataframe tbody tr th:only-of-type {\n",
       "        vertical-align: middle;\n",
       "    }\n",
       "\n",
       "    .dataframe tbody tr th {\n",
       "        vertical-align: top;\n",
       "    }\n",
       "\n",
       "    .dataframe thead th {\n",
       "        text-align: right;\n",
       "    }\n",
       "</style>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "      <th>Pegasus_Hall</th>\n",
       "      <th>Room_A</th>\n",
       "      <th>Room_D</th>\n",
       "      <th>Theater_1</th>\n",
       "      <th>Theater_2</th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "    <tr>\n",
       "      <th>Baseline Off (Hrs)</th>\n",
       "      <td>0</td>\n",
       "      <td>4</td>\n",
       "      <td>4</td>\n",
       "      <td>4</td>\n",
       "      <td>4</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>Baseline 1-Stage Clg (Hrs)</th>\n",
       "      <td>3</td>\n",
       "      <td>0</td>\n",
       "      <td>0</td>\n",
       "      <td>0</td>\n",
       "      <td>0</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>Baseline 2-Stage Clg (Hrs)</th>\n",
       "      <td>1</td>\n",
       "      <td>0</td>\n",
       "      <td>0</td>\n",
       "      <td>0</td>\n",
       "      <td>0</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>Baseline Missing Data (Hrs)</th>\n",
       "      <td>0</td>\n",
       "      <td>0</td>\n",
       "      <td>0</td>\n",
       "      <td>0</td>\n",
       "      <td>0</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>DR Event Off (Hrs)</th>\n",
       "      <td>4</td>\n",
       "      <td>0</td>\n",
       "      <td>0</td>\n",
       "      <td>4</td>\n",
       "      <td>4</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>DR Event 1-Stage Clg (Hrs)</th>\n",
       "      <td>0</td>\n",
       "      <td>4</td>\n",
       "      <td>4</td>\n",
       "      <td>0</td>\n",
       "      <td>0</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>DR Event 2-Stage Clg (Hrs)</th>\n",
       "      <td>0</td>\n",
       "      <td>0</td>\n",
       "      <td>0</td>\n",
       "      <td>0</td>\n",
       "      <td>0</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>DR Event Missing Data (Hrs)</th>\n",
       "      <td>0</td>\n",
       "      <td>0</td>\n",
       "      <td>0</td>\n",
       "      <td>0</td>\n",
       "      <td>0</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>Baseline Adjusted Runtime</th>\n",
       "      <td>5</td>\n",
       "      <td>0</td>\n",
       "      <td>0</td>\n",
       "      <td>0</td>\n",
       "      <td>0</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>DR Event Adjusted Runtime</th>\n",
       "      <td>0</td>\n",
       "      <td>4</td>\n",
       "      <td>4</td>\n",
       "      <td>0</td>\n",
       "      <td>0</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>Ratio</th>\n",
       "      <td>0</td>\n",
       "      <td>inf</td>\n",
       "      <td>inf</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>Savings</th>\n",
       "      <td>100%</td>\n",
       "      <td>-inf%</td>\n",
       "      <td>-inf%</td>\n",
       "      <td>nan%</td>\n",
       "      <td>nan%</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>Stage-1 Clg Demand (kW)</th>\n",
       "      <td>8.25</td>\n",
       "      <td>1.925</td>\n",
       "      <td>1.925</td>\n",
       "      <td>4.125</td>\n",
       "      <td>4.125</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>Stage-2 Clg Demand (kW)</th>\n",
       "      <td>8.25</td>\n",
       "      <td>1.925</td>\n",
       "      <td>1.925</td>\n",
       "      <td>4.125</td>\n",
       "      <td>4.125</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>Zone Runtime kWh (Baseline)</th>\n",
       "      <td>41.25</td>\n",
       "      <td>0</td>\n",
       "      <td>0</td>\n",
       "      <td>0</td>\n",
       "      <td>0</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>Zone Runtime kWh (DR Event)</th>\n",
       "      <td>0</td>\n",
       "      <td>7.7</td>\n",
       "      <td>7.7</td>\n",
       "      <td>0</td>\n",
       "      <td>0</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>Zone Runtime kWh Savings (Baseline - DR Event)</th>\n",
       "      <td>41.25</td>\n",
       "      <td>-7.7</td>\n",
       "      <td>-7.7</td>\n",
       "      <td>0</td>\n",
       "      <td>0</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>Zone Area</th>\n",
       "      <td>3082</td>\n",
       "      <td>420</td>\n",
       "      <td>686</td>\n",
       "      <td>1660</td>\n",
       "      <td>1694</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>Zone Volume</th>\n",
       "      <td>29875.6</td>\n",
       "      <td>3223.96</td>\n",
       "      <td>5666.52</td>\n",
       "      <td>16036</td>\n",
       "      <td>16407.5</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>Net Area All Zones</th>\n",
       "      <td>12696</td>\n",
       "      <td>12696</td>\n",
       "      <td>12696</td>\n",
       "      <td>12696</td>\n",
       "      <td>12696</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>Meter Multiplier</th>\n",
       "      <td>120</td>\n",
       "      <td>120</td>\n",
       "      <td>120</td>\n",
       "      <td>120</td>\n",
       "      <td>120</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>Building Event Energy (kWh)</th>\n",
       "      <td>1953.61</td>\n",
       "      <td>1953.61</td>\n",
       "      <td>1953.61</td>\n",
       "      <td>1953.61</td>\n",
       "      <td>1953.61</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>Zone EUI (kWh/SF)</th>\n",
       "      <td>0</td>\n",
       "      <td>0.0183333</td>\n",
       "      <td>0.0112245</td>\n",
       "      <td>0</td>\n",
       "      <td>0</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>Building EUI (kWh/SF)</th>\n",
       "      <td>0.153876</td>\n",
       "      <td>0.153876</td>\n",
       "      <td>0.153876</td>\n",
       "      <td>0.153876</td>\n",
       "      <td>0.153876</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>Zone SF % of GSF</th>\n",
       "      <td>24%</td>\n",
       "      <td>3%</td>\n",
       "      <td>5%</td>\n",
       "      <td>13%</td>\n",
       "      <td>13%</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>Zone Energy % of Building Energy</th>\n",
       "      <td>0%</td>\n",
       "      <td>0%</td>\n",
       "      <td>0%</td>\n",
       "      <td>0%</td>\n",
       "      <td>0%</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>GHG Emissions Reductions (lbs-CO2/event)</th>\n",
       "      <td>21.615</td>\n",
       "      <td>-4.0348</td>\n",
       "      <td>-4.0348</td>\n",
       "      <td>0</td>\n",
       "      <td>0</td>\n",
       "    </tr>\n",
       "  </tbody>\n",
       "</table>\n",
       "</div>"
      ],
      "text/plain": [
       "                                               Pegasus_Hall     Room_A  \\\n",
       "Baseline Off (Hrs)                                        0          4   \n",
       "Baseline 1-Stage Clg (Hrs)                                3          0   \n",
       "Baseline 2-Stage Clg (Hrs)                                1          0   \n",
       "Baseline Missing Data (Hrs)                               0          0   \n",
       "DR Event Off (Hrs)                                        4          0   \n",
       "DR Event 1-Stage Clg (Hrs)                                0          4   \n",
       "DR Event 2-Stage Clg (Hrs)                                0          0   \n",
       "DR Event Missing Data (Hrs)                               0          0   \n",
       "Baseline Adjusted Runtime                                 5          0   \n",
       "DR Event Adjusted Runtime                                 0          4   \n",
       "Ratio                                                     0        inf   \n",
       "Savings                                                100%      -inf%   \n",
       "Stage-1 Clg Demand (kW)                                8.25      1.925   \n",
       "Stage-2 Clg Demand (kW)                                8.25      1.925   \n",
       "Zone Runtime kWh (Baseline)                           41.25          0   \n",
       "Zone Runtime kWh (DR Event)                               0        7.7   \n",
       "Zone Runtime kWh Savings (Baseline - DR Event)        41.25       -7.7   \n",
       "Zone Area                                              3082        420   \n",
       "Zone Volume                                         29875.6    3223.96   \n",
       "Net Area All Zones                                    12696      12696   \n",
       "Meter Multiplier                                        120        120   \n",
       "Building Event Energy (kWh)                         1953.61    1953.61   \n",
       "Zone EUI (kWh/SF)                                         0  0.0183333   \n",
       "Building EUI (kWh/SF)                              0.153876   0.153876   \n",
       "Zone SF % of GSF                                        24%         3%   \n",
       "Zone Energy % of Building Energy                         0%         0%   \n",
       "GHG Emissions Reductions (lbs-CO2/event)             21.615    -4.0348   \n",
       "\n",
       "                                                   Room_D Theater_1 Theater_2  \n",
       "Baseline Off (Hrs)                                      4         4         4  \n",
       "Baseline 1-Stage Clg (Hrs)                              0         0         0  \n",
       "Baseline 2-Stage Clg (Hrs)                              0         0         0  \n",
       "Baseline Missing Data (Hrs)                             0         0         0  \n",
       "DR Event Off (Hrs)                                      0         4         4  \n",
       "DR Event 1-Stage Clg (Hrs)                              4         0         0  \n",
       "DR Event 2-Stage Clg (Hrs)                              0         0         0  \n",
       "DR Event Missing Data (Hrs)                             0         0         0  \n",
       "Baseline Adjusted Runtime                               0         0         0  \n",
       "DR Event Adjusted Runtime                               4         0         0  \n",
       "Ratio                                                 inf       NaN       NaN  \n",
       "Savings                                             -inf%      nan%      nan%  \n",
       "Stage-1 Clg Demand (kW)                             1.925     4.125     4.125  \n",
       "Stage-2 Clg Demand (kW)                             1.925     4.125     4.125  \n",
       "Zone Runtime kWh (Baseline)                             0         0         0  \n",
       "Zone Runtime kWh (DR Event)                           7.7         0         0  \n",
       "Zone Runtime kWh Savings (Baseline - DR Event)       -7.7         0         0  \n",
       "Zone Area                                             686      1660      1694  \n",
       "Zone Volume                                       5666.52     16036   16407.5  \n",
       "Net Area All Zones                                  12696     12696     12696  \n",
       "Meter Multiplier                                      120       120       120  \n",
       "Building Event Energy (kWh)                       1953.61   1953.61   1953.61  \n",
       "Zone EUI (kWh/SF)                               0.0112245         0         0  \n",
       "Building EUI (kWh/SF)                            0.153876  0.153876  0.153876  \n",
       "Zone SF % of GSF                                       5%       13%       13%  \n",
       "Zone Energy % of Building Energy                       0%        0%        0%  \n",
       "GHG Emissions Reductions (lbs-CO2/event)          -4.0348         0         0  "
      ]
     },
     "metadata": {},
     "output_type": "display_data"
    }
   ],
   "source": [
    "#Baseline 1-Stage Clg (Hrs) & #Baseline 2-Stage Clg (Hrs)\n",
    "\n",
    "    ##Reindex DF & rename rows\n",
    "baseline_runtime = fin_Compa.iloc[[0,2,5,6]] #select only the cooling stages [1:-1]\n",
    "baseline_runtime.rename({0: 'Baseline Off (Hrs)', \n",
    "                         2: 'Baseline 1-Stage Clg (Hrs)', \n",
    "                         5: 'Baseline 2-Stage Clg (Hrs)', \n",
    "                         6: 'Baseline Missing Data (Hrs)'}, axis='index', inplace=True)\n",
    "baseline_runtime.drop('State', axis=1, inplace=True)\n",
    "#display(baseline_runtime)\n",
    "\n",
    "#DR Event 1-Stage Clg (Hrs) & #DR Event 2-Stage Clg (Hrs)\n",
    "\n",
    "    ##Reindex DF & rename rows\n",
    "event_runtime = fin_Eventa.iloc[[0,2,5,6]] #select only the cooling stages [1:-1]\n",
    "event_runtime.rename({0: 'DR Event Off (Hrs)', \n",
    "                      2: 'DR Event 1-Stage Clg (Hrs)', \n",
    "                      5: 'DR Event 2-Stage Clg (Hrs)', \n",
    "                      6: 'DR Event Missing Data (Hrs)'}, axis='index', inplace=True)\n",
    "event_runtime.drop('State', axis=1, inplace=True)\n",
    "#display(event_runtime)\n",
    "\n",
    "site_runtime = pd.concat([baseline_runtime, event_runtime], join_axes=[baseline_runtime.columns])\n",
    "    \n",
    "#Adjusted Baseline & DR Event Runtime ((Stage-1) + (2 * Stage-2))\n",
    "\n",
    "site_runtime.loc['Baseline Adjusted Runtime',:] = site_runtime.loc['Baseline 2-Stage Clg (Hrs)',:].mul(2) + site_runtime.loc['Baseline 1-Stage Clg (Hrs)',:]\n",
    "site_runtime.loc['DR Event Adjusted Runtime',:] = site_runtime.loc['DR Event 2-Stage Clg (Hrs)',:].mul(2) + site_runtime.loc['DR Event 1-Stage Clg (Hrs)',:]\n",
    "\n",
    "## Round Numbers by row? or at the end?\n",
    "# Ratio['Baseline'] = pd.Series([round(val, 1) for val in Ratio['Baseline']], index = Ratio.index)\n",
    "# Ratio['DR Event'] = pd.Series([round(val, 1) for val in Ratio['DR Event']], index = Ratio.index)\n",
    "\n",
    "##Ratio (DR Event/Baseline) - calculated\n",
    "site_runtime.loc['Ratio',:] = (site_runtime.loc['DR Event Adjusted Runtime',:]/site_runtime.loc['Baseline Adjusted Runtime',:]).round(2)\n",
    "\n",
    "##Savings ((Baseline - DR Event) / Baseline), Calculate % savings between Event day and Comp Day runtimes\n",
    "site_runtime.loc['Savings',:] = ((site_runtime.loc['Baseline Adjusted Runtime',:] - site_runtime.loc['DR Event Adjusted Runtime',:])/site_runtime.loc['Baseline Adjusted Runtime',:]).apply('{:.0%}'.format)\n",
    "\n",
    "##Get peak demand for stage 1 and stage 2 cooling from DF\n",
    "\n",
    "##Read Excel with building system data\n",
    "filepath = '/Users/gregthomson/Box Sync/Sponsor Awards/CEC 84748 XBOS-DR/CEC XBOS-DR/Project Management/Potential building sites/DR_Planning_Docs/Test_Python/XBOS_DR_Runtime_SiteZone_Base.xlsx'\n",
    "#XBOS_DR_Runtime_SiteZone = pd.read_excel(filepath)\n",
    "#print XBOS_DR_Runtime_SiteZone.columns\n",
    "cols_to_drop = ['Htg-S1 Power', 'Htg-S2 Power', 'Clg-S1 Power', 'Clg-S2 Power', 'Fan Power']\n",
    "controlled_zones = pd.read_excel(filepath)\n",
    "controlled_zones.drop(cols_to_drop, axis=1, inplace=True)\n",
    "\n",
    "##Sort for zones controlled during dr events\n",
    "controlled_zones = controlled_zones.loc[controlled_zones['Controllable Zone (0=False, 1=True)'] == 1]\n",
    "\n",
    "##Reset index of DF and drop unneccessary columns\n",
    "rtu_power = controlled_zones.reset_index(inplace=False, drop=True)\n",
    "cols_to_drop2 = ['Controllable Zone (0=False, 1=True)', 'Occupancy Sensor (0=False, 1=True)', 'Occupancy Sensor Permanent (0=False, 1=True)', 'Heating Stages', 'Cooling Stages', 'Fan Stages']\n",
    "rtu_power.drop(cols_to_drop2, axis=1, inplace=True) \n",
    "\n",
    "##Keep only data for zones from filter\n",
    "zone_filter = rtu_power\n",
    "cols_to_keep = ['HVAC_Zone_Pegasus_Hall', \n",
    "                'HVAC_Zone_Room_A', \n",
    "                'HVAC_Zone_Room_D', \n",
    "                'HVAC_Zone_Theater_1', \n",
    "                'HVAC_Zone_Theater_2']\n",
    "zones = zone_filter[zone_filter['Zone'].isin(cols_to_keep)]\n",
    "\n",
    "##Reorder the columns\n",
    "frame = zones.T\n",
    "frame = frame[[9, 10, 11, 7, 8]]\n",
    "\n",
    "##Extract cooling stage peak demand\n",
    "stage_cooling = frame\n",
    "stage_demand = stage_cooling.drop(stage_cooling.index[[1, 2, 5, 6, 7, 8]]) #, inplace=True\n",
    "\n",
    "##Reset index\n",
    "demand = stage_demand.T\n",
    "\n",
    "##Strip HVAC_Zone_ characters from the Zone column\n",
    "demand['Zone'] = demand['Zone'].str.replace('HVAC_Zone_', '')\n",
    "zone_list2 = demand['Zone'].tolist()\n",
    "\n",
    "##Rename column headers\n",
    "df_peak_demand = demand.T\n",
    "df_peak_demand.columns = zone_list2\n",
    "df_peak_demand = df_peak_demand.reset_index() #drop=True\n",
    "df_peak_demand = df_peak_demand.set_index('index', drop=True)#, inplace=True)\n",
    "\n",
    "site_runtime.loc['Stage-1 Clg Demand (kW)',:] = df_peak_demand.loc['Clg-S1 kW']#['Clg-S1 kW']\n",
    "site_runtime.loc['Stage-2 Clg Demand (kW)',:] = df_peak_demand.loc['Clg-S2 kW']#['Clg-S1 kW']\n",
    "\n",
    "##Calculate total energy consumption from Runtime * Peak Demand (in Hours) for whole day\n",
    "##Make sure these calculations are using the Peak Demand for appropriate zone\n",
    "##Calculation (S1=(runtime*peak demand) + S2 = (runtime * (2*peak demand)))\n",
    "\n",
    "#Zone Runtime kWh (Baseline)\n",
    "site_runtime.loc['Zone Runtime kWh (Baseline)',:] = (site_runtime.iloc[1,0:].mul(site_runtime.iloc[12,0:]))+2*(site_runtime.iloc[2,0:].mul(site_runtime.iloc[13,0:]))\n",
    "\n",
    "#Zone Runtime kWh (DR Event)\n",
    "site_runtime.loc['Zone Runtime kWh (DR Event)',:] = (site_runtime.iloc[5,0:].mul(site_runtime.iloc[12,0:]))+2*(site_runtime.iloc[6,0:].mul(site_runtime.iloc[13,0:]))\n",
    "\n",
    "#Zone Runtime kWh Savings (Baseline - DR Event)\n",
    "site_runtime.loc['Zone Runtime kWh Savings (Baseline - DR Event)',:] = (site_runtime.loc['Zone Runtime kWh (Baseline)',:])-(site_runtime.loc['Zone Runtime kWh (DR Event)',:])\n",
    "\n",
    "#Zone Area (SF)\n",
    "#Zone Volume (CF)\n",
    "#Net Area All Zones (GSF)\n",
    "\n",
    "##Get Zone areas, etc., only use the index, zone, zone area, and zone volume columns\n",
    "XBOS_DR_ZoneEUI = pd.read_excel(filepath, sheet_name='Sites_Zones', usecols='A,B,S:V')\n",
    "\n",
    "zone_list = cols_to_keep\n",
    "site_select = XBOS_DR_ZoneEUI.loc[XBOS_DR_ZoneEUI['Zone'].isin(zone_list)]\n",
    "site_zones = site_select.reset_index(drop=True) #inplace=False\n",
    "\n",
    "##Strip HVAC_Zone_ characters from the Zone column\n",
    "site_zones['Zone'] = site_zones['Zone'].str.replace('HVAC_Zone_', '')\n",
    "\n",
    "##Rename column headers\n",
    "df_site_zones = site_zones.T\n",
    "zones = df_site_zones.values.tolist()[0]\n",
    "df_site_zones.columns = zones\n",
    "df_site_zones = df_site_zones.reset_index() #drop=True\n",
    "df_site_zones = df_site_zones.set_index('index', drop=True)#, inplace=True)\n",
    "\n",
    "##Get Building GSF\n",
    "site = SITE #'avenal-movie-theatre' #use SITE from HOD/MDAL\n",
    "site_GSF = XBOS_DR_ZoneEUI.groupby(XBOS_DR_ZoneEUI.index).get_group(site)\n",
    "GSF = site_GSF.loc[site_GSF['Zone'] == 'HVAC_Zone_Lobby', 'Net Area All Zones'].iloc[0]\n",
    "multiplier = site_GSF.loc[site_GSF['Zone'] == 'HVAC_Zone_Lobby', 'Meter Multiplier'].iloc[0]\n",
    "\n",
    "##Fill in all NaNs with net area\n",
    "value = GSF\n",
    "multiplier_value = multiplier #meter multiplier\n",
    "df_site_zones.loc['Net Area All Zones'] = df_site_zones.loc['Net Area All Zones'].fillna(value)\n",
    "\n",
    "##Append Zone information to DF\n",
    "site_runtime.loc['Zone Area'] = (df_site_zones.iloc[1,0:])\n",
    "site_runtime.loc['Zone Volume'] = (df_site_zones.iloc[2,0:])\n",
    "site_runtime.loc['Net Area All Zones'] = (df_site_zones.iloc[3,0:])\n",
    "site_runtime.loc['Meter Multiplier'] = multiplier_value\n",
    "\n",
    "#Building Event Energy (kWh)\n",
    "\n",
    "##Reset the index of df\n",
    "eagle_data = event_demand.reset_index(drop=False) #'DateTime'\n",
    "\n",
    "##Rename the columns \n",
    "new_cols = {'index':'DateTime', 'ea827a42-e6b9-3e0a-970f-c3a96f0ebea3':'Demand (W)'}\n",
    "eagle_data2 = eagle_data.rename(columns=new_cols)\n",
    "\n",
    "##Get Site Meter Multiplier\n",
    "\n",
    "##Fill in all NaNs with multiplier value\n",
    "df_site_zones.loc['Meter Multiplier'] = df_site_zones.loc['Meter Multiplier'].fillna(multiplier_value)\n",
    "\n",
    "##Calculate energy kWh from demand W\n",
    "event_energy = eagle_data2\n",
    "event_energy['Meter Multiplier'] = multiplier_value\n",
    "event_energy['Event Energy (kWh)'] = (((eagle_data2.iloc[:, 1]*multiplier_value )/ 1000) * 0.25)\n",
    "\n",
    "##Sum total energy for window of analysis\n",
    "energy = event_energy['Event Energy (kWh)'].sum()\n",
    "\n",
    "##Event day energy total \n",
    "site_runtime.loc['Building Event Energy (kWh)'] = energy.round(2) #event_energy['Event Energy (kWh)'].sum()\n",
    "\n",
    "#Zone EUI (kWh/SF)\n",
    "##Calculate the EUI for the each zone (Zone Energy/Zone Area), then Round numbers\n",
    "site_runtime.loc['Zone EUI (kWh/SF)'] = (site_runtime.loc['Zone Runtime kWh (DR Event)'] / site_runtime.loc['Zone Area'])#.round(4)\n",
    "\n",
    "#Building EUI (kWh/SF)\n",
    "##Calculate the Event day EUI for the whole building (Bldg Evnt Energy/Bldg Area), then Round numbers\n",
    "site_runtime.loc['Building EUI (kWh/SF)'] = (site_runtime.loc['Building Event Energy (kWh)'] / site_runtime.loc['Net Area All Zones'])#.round(4)\n",
    "\n",
    "#Zone SF % of GSF\n",
    "##Calculate the zone area as a percent of total GSF, then convert to percent\n",
    "site_runtime.loc['Zone SF % of GSF'] = (site_runtime.loc['Zone Area'] / site_runtime.loc['Net Area All Zones']).apply('{:.0%}'.format)\n",
    "\n",
    "#Zone Energy % of Building Energy\n",
    "##Zone Energy as % of Bldg Energy\n",
    "site_runtime.loc['Zone Energy % of Building Energy'] = (site_runtime.loc['Zone Runtime kWh (DR Event)'] / site_runtime.loc['Building Event Energy (kWh)']).apply('{:.0%}'.format)\n",
    "\n",
    "#Zone CO2 savings\n",
    "##Zone Energy Savings * PGE Emissions Factor\n",
    "##PGE emissions for electricity: 0.524 lbs CO2/kWh \n",
    "##National Average: 1,559 lbs CO2/MWh  (5  10-4 tons/lb)  0.001 MWh/kWh = 7.795  10-4 tons CO2/kWh\n",
    "##National Average: 1,559 lbs CO2/MWh  0.001 MWh/kWh = 1.559 lbs CO2/kWh\n",
    "site_runtime.loc['GHG Emissions Reductions (lbs-CO2/event)'] = (site_runtime.loc['Zone Runtime kWh Savings (Baseline - DR Event)'] * 0.524) #\n",
    "\n",
    "display(site_runtime)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 40,
   "metadata": {},
   "outputs": [],
   "source": [
    "event_report = site_runtime\n",
    "event_report.to_csv(str(site)+'_'+str(date_Comp)+'-'+str(date_Event)+'.csv')"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 42,
   "metadata": {},
   "outputs": [],
   "source": [
    "# SELECT * WHERE {\n",
    "#   ?wspd rdf:type brick:Weather_Wind_Speed_Sensor .\n",
    "#   ?wspd bf:hasSite ?site .\n",
    "# };"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "metadata": {},
   "outputs": [],
   "source": []
  }
 ],
 "metadata": {
  "kernelspec": {
   "display_name": "Python 2",
   "language": "python",
   "name": "python2"
  },
  "language_info": {
   "codemirror_mode": {
    "name": "ipython",
    "version": 2
   },
   "file_extension": ".py",
   "mimetype": "text/x-python",
   "name": "python",
   "nbconvert_exporter": "python",
   "pygments_lexer": "ipython2",
   "version": "2.7.15"
  }
 },
 "nbformat": 4,
 "nbformat_minor": 2
}
